#Использовать packageinfo

Перем _ВерсияПриложения; // Строка

#Область ОбработчикиСобытий

// Создает контроллер главной страницы веб-приложения.
&Контроллер("/")
Процедура ПриСозданииОбъекта()

	_ВерсияПриложения = Новый ИнформацияОПакете(ПутьКPackagedef()).Версия();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПутьКPackagedef()

	Возврат Новый Файл(ОбъединитьПути(ТекущийСценарий().Каталог, "../../../packagedef")).ПолноеИмя;

КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Отображает главную страницу приложения.
//
// Параметры:
//   Ответ - HTTPОтвет - HTTP-ответ для формирования модели шаблона.
&ТочкаМаршрута("")
&Отображение("./src/web/view/index.html")
Процедура Главная(Ответ) Экспорт

	Ответ.Модель = Новый Структура(
		"ВерсияПриложения, СсылкаНаВерсию",
		_ВерсияПриложения,
		"https://github.com/alei1180/curlone/releases/tag/ver" + _ВерсияПриложения
	);

КонецПроцедуры

#КонецОбласти
