#Область ПрограммныйИнтерфейс

// Записывает результат выполнения curlone в системные потоки.
//
// Параметры:
//   Результат - РезультатВыполненияCurlone - Данные для stdout и stderr.
Процедура Записать(Результат) Экспорт

	ЗаписатьВПоток(
		Консоль.ОткрытьСтандартныйПотокВывода(),
		Результат.СтандартныйВывод()
	);

	ЗаписатьВПоток(
		Консоль.ОткрытьСтандартныйПотокОшибок(),
		Результат.ВыводОшибок()
	);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьВПоток(Поток, Текст)

	Если ПустаяСтрока(Текст) Тогда
		Возврат;
	КонецЕсли;

	Запись = Новый ЗаписьДанных(Поток, Консоль.КодировкаВыходногоПотока);
	Запись.ЗаписатьСимволы(Текст);
	Запись.Закрыть();

КонецПроцедуры

#КонецОбласти
