#Область ПрограммныйИнтерфейс

// Записывает результат выполнения curlone в системные потоки.
//
// Параметры:
//   Результат - РезультатВыполненияCurlone - Данные для stdout и stderr.
Процедура Записать(Результат) Экспорт

	Если Результат.ПутьВывода() <> Неопределено Тогда
		ЗаписатьВФайл(Результат.ПутьВывода(), Результат.СодержимоеФайла());
	КонецЕсли;

	ЗаписатьВПоток(
		Консоль.ОткрытьСтандартныйПотокВывода(),
		Результат.СтандартныйВывод()
	);

	ЗаписатьВПоток(
		Консоль.ОткрытьСтандартныйПотокОшибок(),
		Результат.ВыводОшибок()
	);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьВФайл(Путь, Содержимое)

	ПолныйПуть = Новый Файл(Путь).ПолноеИмя;
	Запись = Новый ЗаписьТекста(ПолныйПуть, КодировкаТекста.UTF8);
	Запись.Записать(Содержимое);
	Запись.Закрыть();

КонецПроцедуры

Процедура ЗаписатьВПоток(Поток, Текст)

	Если ПустаяСтрока(Текст) Тогда
		Возврат;
	КонецЕсли;

	Запись = Новый ЗаписьДанных(Поток, Консоль.КодировкаВыходногоПотока);
	Запись.ЗаписатьСимволы(Текст + Символы.ПС);
	Запись.Закрыть();

КонецПроцедуры

#КонецОбласти
