Перем _Порт; // Число

#Область ОбработчикиСобытий

// Создает отложенное открытие веб-интерфейса.
//
// Параметры:
//   Порт - Число - Порт веб-сервера.
Процедура ПриСозданииОбъекта(Порт)

	_Порт = Порт;

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Открывает веб-интерфейс после запуска сервера.
Процедура ОткрытьСЗадержкой() Экспорт

	ЗадержкаПередЗапуском = 500; // мс
	Адрес = СтрШаблон("http://localhost:%1", Формат(_Порт, "ЧГ=0"));

	Приостановить(ЗадержкаПередЗапуском);
	ЗапуститьПриложение(Адрес);

КонецПроцедуры

#КонецОбласти
