#Использовать errors

Перем _КодЗавершения; // Число
Перем _СтандартныйВывод; // Строка
Перем _ВыводОшибок; // Строка

#Область ОбработчикиСобытий

// Создаёт результат выполнения команды curlone.
//
// Параметры:
//   КодЗавершения - Число - Код завершения процесса.
//   СтандартныйВывод - Строка - Текст для stdout.
//   ВыводОшибок - Строка - Текст для stderr.
Процедура ПриСозданииОбъекта(КодЗавершения, СтандартныйВывод, ВыводОшибок)

	_КодЗавершения = КодЗавершения;
	_СтандартныйВывод = СтандартныйВывод;
	_ВыводОшибок = ВыводОшибок;

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает код завершения.
//
// Возвращаемое значение:
//   Число - Код завершения процесса.
Функция КодЗавершения() Экспорт

	Возврат _КодЗавершения;

КонецФункции

// Возвращает стандартный вывод.
//
// Возвращаемое значение:
//   Строка - Текст для stdout.
Функция СтандартныйВывод() Экспорт

	Возврат _СтандартныйВывод;

КонецФункции

// Возвращает вывод ошибок.
//
// Возвращаемое значение:
//   Строка - Текст для stderr.
Функция ВыводОшибок() Экспорт

	Возврат _ВыводОшибок;

КонецФункции

#КонецОбласти
