Перем СостояниеКод Экспорт; // Число
Перем СостояниеТекст Экспорт; // Строка
Перем Заголовки Экспорт; // Соответствие
Перем ТелоТекст Экспорт; // Строка

#Область ОбработчикиСобытий

Процедура ПриСозданииОбъекта()

	СостояниеКод = 0;
	СостояниеТекст = "";
	Заголовки = Новый Соответствие;
	ТелоТекст = "";

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Устанавливает тип содержимого тестового ответа.
//
// Параметры:
//   ТипКонтента - Строка - Краткое имя типа содержимого.
Процедура УстановитьТипКонтента(ТипКонтента) Экспорт

	Если ТипКонтента <> "json" Тогда
		ВызватьИсключение "Тестовый ответ поддерживает только JSON";
	КонецЕсли;

	Заголовки.Вставить("Content-Type", "application/json");

КонецПроцедуры

#КонецОбласти
