#Использовать asserts
#Использовать "../../src/cli"

#Область Тесты

&Тест
Процедура ТестДолжен_ВернутьКодыЗавершенияCLI() Экспорт

	// Действие и Проверка
	Ожидаем.Что(КодыЗавершенияCurlone.Успех(), "Успешное завершение").Равно(0);
	Ожидаем.Что(КодыЗавершенияCurlone.ВнутренняяОшибка(), "Внутренняя ошибка").Равно(1);
	Ожидаем.Что(КодыЗавершенияCurlone.ОшибкаИспользования(), "Ошибка использования").Равно(2);
	Ожидаем.Что(КодыЗавершенияCurlone.ОшибкаКонвертации(), "Ошибка конвертации").Равно(3);
	Ожидаем.Что(КодыЗавершенияCurlone.ОшибкаГенератора(), "Ошибка генератора").Равно(4);
	Ожидаем.Что(КодыЗавершенияCurlone.ПредупреждениеКакОшибка(), "Предупреждение как ошибка").Равно(5);

КонецПроцедуры

#КонецОбласти
