Перем _ОписаниеЗапроса; // ОписаниеЗапроса
Перем _НазначениеДанных; // НазначенияПередаваемыхДанных
Перем _ПрочитанныеФайлы; // Массив из Структура
Перем _ИмяПеременнойДанных; // Строка
Перем _ИмяПеременнойЧастей; // Строка

// Конструктор объекта.
//
// Параметры:
//   ОписаниеЗапроса       - ОписаниеЗапроса
//   НазначениеДанных      - НазначенияПередаваемыхДанных
//   ПрочитанныеФайлы      - Массив из Структура
//   ИмяПеременнойДанных   - Строка - Имя переменной для собранных двоичных данных
//   ИмяПеременнойЧастей   - Строка - Имя переменной массива частей тела
Процедура ПриСозданииОбъекта(ОписаниеЗапроса, НазначениеДанных, ПрочитанныеФайлы,
	ИмяПеременнойДанных, ИмяПеременнойЧастей)

	_ОписаниеЗапроса = ОписаниеЗапроса;
	_НазначениеДанных = НазначениеДанных;
	_ПрочитанныеФайлы = ПрочитанныеФайлы;
	_ИмяПеременнойДанных = ИмяПеременнойДанных;
	_ИмяПеременнойЧастей = ИмяПеременнойЧастей;

КонецПроцедуры

#Область ПрограммныйИнтерфейс

// Формирует программный код сборки двоичных данных запроса.
//
// Возвращаемое значение:
//   Строка - Программный код
Функция Получить() Экспорт

	ДвоичныеФайлы = _ОписаниеЗапроса.ДвоичныеФайлыПоНазначению(_НазначениеДанных);
	ТекстовыеДанные = Новый ГенераторКодаДанныеЗапроса(
		_ОписаниеЗапроса,
		_НазначениеДанных,
		_ПрочитанныеФайлы
	).Получить();

	Конструктор = Новый КонструкторПрограммногоКода(_ОписаниеЗапроса.ИменаПеременных);

	Если ДвоичныеФайлы.Количество() = 1 И Не ЗначениеЗаполнено(ТекстовыеДанные) Тогда
		Конструктор.ДобавитьСтроку(
			"%1 = Новый ДвоичныеДанные(%2);",
			_ИмяПеременнойДанных,
			Конструктор.ПараметрВСтроку(ДвоичныеФайлы[0].ПолноеИмяФайла)
		);
		Возврат Конструктор.ПолучитьРезультат();
	КонецЕсли;

	Конструктор.ДобавитьСтроку("%1 = Новый Массив();", _ИмяПеременнойЧастей);
	НуженРазделитель = Ложь;

	Если ЗначениеЗаполнено(ТекстовыеДанные) Тогда
		Конструктор.ДобавитьСтроку(
			"%1.Добавить(ПолучитьДвоичныеДанныеИзСтроки(
			|	%2, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать));",
			_ИмяПеременнойЧастей,
			ТекстовыеДанные
		);
		НуженРазделитель = Истина;
	КонецЕсли;

	Для Каждого ДвоичныйФайл Из ДвоичныеФайлы Цикл
		Если НуженРазделитель Тогда
			ДобавитьРазделитель(Конструктор);
		КонецЕсли;

		Конструктор.ДобавитьСтроку(
			"%1.Добавить(Новый ДвоичныеДанные(%2));",
			_ИмяПеременнойЧастей,
			Конструктор.ПараметрВСтроку(ДвоичныйФайл.ПолноеИмяФайла)
		);
		НуженРазделитель = Истина;
	КонецЦикла;

	Конструктор.ДобавитьСтроку(
		"%1 = СоединитьДвоичныеДанные(%2);",
		_ИмяПеременнойДанных,
		_ИмяПеременнойЧастей
	);

	Возврат Конструктор.ПолучитьРезультат();

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьРазделитель(Конструктор)
	Конструктор.ДобавитьСтроку(
		"%1.Добавить(ПолучитьДвоичныеДанныеИзСтроки(
		|	""&"", КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать));",
		_ИмяПеременнойЧастей
	);
КонецПроцедуры

#КонецОбласти
