Перем _ОписаниеЗапроса; // ОписаниеЗапроса
Перем _НазначениеДанных; // НазначенияПередаваемыхДанных
Перем _ПрочитанныеФайлы; // Массив из Структура
Перем _ИмяПеременнойДанных; // Строка
Перем _ИмяПеременнойЧастей; // Строка

// Конструктор объекта.
//
// Параметры:
//   ОписаниеЗапроса       - ОписаниеЗапроса
//   НазначениеДанных      - НазначенияПередаваемыхДанных
//   ПрочитанныеФайлы      - Массив из Структура
//   ИмяПеременнойДанных   - Строка - Имя переменной для собранных двоичных данных
//   ИмяПеременнойЧастей   - Строка - Имя переменной массива частей тела
Процедура ПриСозданииОбъекта(ОписаниеЗапроса, НазначениеДанных, ПрочитанныеФайлы,
	ИмяПеременнойДанных, ИмяПеременнойЧастей)

	_ОписаниеЗапроса = ОписаниеЗапроса;
	_НазначениеДанных = НазначениеДанных;
	_ПрочитанныеФайлы = ПрочитанныеФайлы;
	_ИмяПеременнойДанных = ИмяПеременнойДанных;
	_ИмяПеременнойЧастей = ИмяПеременнойЧастей;

КонецПроцедуры

#Область ПрограммныйИнтерфейс

// Формирует программный код сборки двоичных данных запроса.
//
// Возвращаемое значение:
//   Строка - Программный код
Функция Получить() Экспорт

	ДанныеЗапроса = _ОписаниеЗапроса.ДанныеПоНазначениюВИсходномПорядке(_НазначениеДанных);
	Конструктор = Новый КонструкторПрограммногоКода(_ОписаниеЗапроса.ИменаПеременных);

	Если ДанныеЗапроса.Количество() = 1 И ЭтоДвоичныйФайл(ДанныеЗапроса[0]) Тогда
		Конструктор.ДобавитьСтроку(
			"%1 = Новый ДвоичныеДанные(%2);",
			_ИмяПеременнойДанных,
			Конструктор.ПараметрВСтроку(ДанныеЗапроса[0].ПолноеИмяФайла)
		);
		Возврат Конструктор.ПолучитьРезультат();
	КонецЕсли;

	Конструктор.ДобавитьСтроку("%1 = Новый Массив();", _ИмяПеременнойЧастей);
	НуженРазделитель = Ложь;
	ТекстовыеДанные = "";

	Для Каждого ПередаваемыеДанные Из ДанныеЗапроса Цикл

		Если Не ЭтоДвоичныйФайл(ПередаваемыеДанные) Тогда
			Если Не ЗначениеЗаполнено(ТекстовыеДанные) И НуженРазделитель Тогда
				ДобавитьРазделитель(Конструктор, ПередаваемыеДанные.РазделительТелаЗапроса);
				НуженРазделитель = Ложь;
			КонецЕсли;
			ДобавитьВТекстовыеДанные(ТекстовыеДанные, ПередаваемыеДанные, Конструктор);
			Продолжить;
		КонецЕсли;

		ДобавитьТекстовыеДанные(Конструктор, ТекстовыеДанные, НуженРазделитель);
		
		Если НуженРазделитель Тогда
			ДобавитьРазделитель(Конструктор, ПередаваемыеДанные.РазделительТелаЗапроса);
		КонецЕсли;

		Конструктор.ДобавитьСтроку(
			"%1.Добавить(Новый ДвоичныеДанные(%2));",
			_ИмяПеременнойЧастей,
			Конструктор.ПараметрВСтроку(ПередаваемыеДанные.ПолноеИмяФайла)
		);

		НуженРазделитель = Истина;

	КонецЦикла;

	ДобавитьТекстовыеДанные(Конструктор, ТекстовыеДанные, НуженРазделитель);

	Конструктор.ДобавитьСтроку(
		"%1 = СоединитьДвоичныеДанные(%2);",
		_ИмяПеременнойДанных,
		_ИмяПеременнойЧастей
	);

	Возврат Конструктор.ПолучитьРезультат();

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЭтоДвоичныйФайл(ПередаваемыеДанные)
	Возврат ТипЗнч(ПередаваемыеДанные) = Тип("ПередаваемыйФайл") И ПередаваемыеДанные.ДвоичноеСодержимое;
КонецФункции

Процедура ДобавитьТекстовыеДанные(Конструктор, ТекстовыеДанные, НуженРазделитель)

	Если Не ЗначениеЗаполнено(ТекстовыеДанные) Тогда
		Возврат;
	КонецЕсли;

	ПараметрыФункции = Новый Массив;
	ПараметрыФункции.Добавить(ТекстовыеДанные);
	ПараметрыФункции.Добавить("КодировкаТекста.UTF8");
	ПараметрыФункции.Добавить("ИспользованиеByteOrderMark.НеИспользовать");

	Конструктор.ДобавитьСтроку(
		"%1.Добавить(ПолучитьДвоичныеДанныеИзСтроки(%2));",
		_ИмяПеременнойЧастей,
		Конструктор.ПараметрыФункцииВСтроку(ПараметрыФункции)
	);

	ТекстовыеДанные = "";
	НуженРазделитель = Истина;

КонецПроцедуры

Процедура ДобавитьВТекстовыеДанные(ТекстовыеДанные, ПередаваемыеДанные, Конструктор)

	ЭтоПервоеЗначение = Не ЗначениеЗаполнено(ТекстовыеДанные);
	Если ТипЗнч(ПередаваемыеДанные) = Тип("ПередаваемыйТекст") Тогда
		Значение = ПередаваемыеДанные.ПолноеЗначение();
		Если Не ЭтоПервоеЗначение Тогда
			Значение = ПередаваемыеДанные.РазделительТелаЗапроса + Значение;
		КонецЕсли;
		ДобавитьВыражение(ТекстовыеДанные, Конструктор.ПараметрВСтроку(Значение));
		Возврат;
	КонецЕсли;

	ИмяПеременной = ИмяПеременнойПрочитанногоФайла(ПередаваемыеДанные);
	Префикс = ?(
		ЗначениеЗаполнено(ПередаваемыеДанные.ИмяПоля),
		ПередаваемыеДанные.ИмяПоля + "=",
		""
	);

	Если Не ЭтоПервоеЗначение Тогда
		Префикс = ПередаваемыеДанные.РазделительТелаЗапроса + Префикс;
	КонецЕсли;

	Выражение = ?(ЗначениеЗаполнено(Префикс), Конструктор.ПараметрВСтроку(Префикс) + " + ", "") + ИмяПеременной;
	ДобавитьВыражение(ТекстовыеДанные, Выражение);

КонецПроцедуры

Процедура ДобавитьВыражение(ТекстовыеДанные, Выражение)

	Если Не ЗначениеЗаполнено(ТекстовыеДанные) Тогда
		ТекстовыеДанные = Выражение;
	Иначе
		ТекстовыеДанные = ТекстовыеДанные + "
		|	+ " + Выражение;
	КонецЕсли;

КонецПроцедуры

Функция ИмяПеременнойПрочитанногоФайла(ПередаваемыйФайл)

	Для Каждого ПрочитанныйФайл Из _ПрочитанныеФайлы Цикл
		Если ПрочитанныйФайл.ПередаваемыйФайл = ПередаваемыйФайл Тогда
			Возврат ПрочитанныйФайл.ИмяПеременной;
		КонецЕсли;
	КонецЦикла;

	Возврат "";

КонецФункции

Процедура ДобавитьРазделитель(Конструктор, Разделитель)

	Конструктор.ДобавитьСтроку(
		"%1.Добавить(ПолучитьДвоичныеДанныеИзСтроки(%2, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать));",
		_ИмяПеременнойЧастей,
		Конструктор.ПараметрВСтроку(Разделитель)
	);

КонецПроцедуры

#КонецОбласти
