#Использовать errors
#Использовать "../../src/syntax"
#Использовать "../../src/domain"
#Использовать "."

#Область Тесты

&ПараметризованныйТест
&ИсточникЗначение("0", "unused", "invalid", Истина, Истина)
&ИсточникЗначение("1", "unused", "2", Истина, Ложь)
&ИсточникЗначение("$COUNT", "0", "invalid", Истина, Истина)
&ИсточникЗначение("$COUNT", "1", "invalid", Ложь, Ложь)
&ИсточникЗначение("$COUNT", "invalid", "invalid", Ложь, Ложь)
Процедура ТестДолжен_УчитыватьАктивностьПовторов(
	Количество,
	Значение,
	Время,
	Успешно,
	ОжидаетсяВычислениеВремени) Экспорт

	// Подготовка
	Операция = Интерпретировать("curl --retry """ + Количество
		+ """ --retry-max-time ""$WAIT"" https://example.org");
	Переменные = Новый Соответствие;
	Переменные.Вставить("COUNT", Значение);
	Переменные.Вставить("WAIT", Время);

	// Действие
	Результат = Новый МатериализаторОперацииCURL().Материализовать(Операция, Переменные);

	// Проверка
	Ожидаем.Что(Результат.Успешно()).Равно(Успешно);
	Если Успешно Тогда
		Время = Результат.Выполнение().Операции()[0].Политики().Повторы().МаксимальноеВремя();
		Ожидаем.Что(Время.ТребуетВычисления()).Равно(ОжидаетсяВычислениеВремени);
	КонецЕсли;

КонецПроцедуры

&Тест
Процедура ТестДолжен_СохранитьДанныеОтключенногоПроксиБезВычисления() Экспорт

	// Подготовка
	Операция = Интерпретировать(
		"curl --proxy-user ""$CREDENTIALS"" --proxy """" https://example.org");
	Переменные = Новый Соответствие;
	Переменные.Вставить("CREDENTIALS", "invalid:value:extra");

	// Действие
	Результат = Новый МатериализаторОперацииCURL().Материализовать(Операция, Переменные);

	// Проверка
	Ожидаем.Что(Результат.Успешно()).Равно(Истина);
	Данные = Результат.Выполнение().Операции()[0].Соединение().Прокси().УчетныеДанные();
	Ожидаем.Что(Данные.ТребуетРазбора()).Равно(Истина);

КонецПроцедуры

&Тест
Процедура ТестДолжен_СохранитьДанныеВычисленногоОтключенногоПрокси() Экспорт

	// Подготовка
	Операция = Интерпретировать(
		"curl --proxy-user ""$CREDENTIALS"" --proxy ""$PROXY"" https://example.org");
	Переменные = Новый Соответствие;
	Переменные.Вставить("PROXY", "");
	Переменные.Вставить("CREDENTIALS", "invalid:value:extra");

	// Действие
	Результат = Новый МатериализаторОперацииCURL().Материализовать(Операция, Переменные);

	// Проверка
	Ожидаем.Что(Результат.Успешно()).Равно(Истина);
	Данные = Результат.Выполнение().Операции()[0].Соединение().Прокси().УчетныеДанные();
	Ожидаем.Что(Данные.ТребуетРазбора()).Равно(Истина);

КонецПроцедуры

&Тест
Процедура ТестДолжен_НеВычислятьДанныеПриОшибочномРежимеПрокси() Экспорт

	// Подготовка
	Операция = Интерпретировать(
		"curl --proxy-user ""$CREDENTIALS"" --proxy ""$PROXY"" https://example.org");
	Переменные = Новый Соответствие;
	Переменные.Вставить("PROXY", "ftp://proxy.example.org");
	Переменные.Вставить("CREDENTIALS", "invalid:value:extra");

	// Действие
	Результат = Новый МатериализаторОперацииCURL().Материализовать(Операция, Переменные);

	// Проверка
	Ожидаем.Что(Результат.Успешно()).Равно(Ложь);
	Ожидаем.Что(Результат.Ошибки()).ИмеетДлину(1);

КонецПроцедуры

&Тест
Процедура ТестДолжен_СохранитьКаталогСтандартногоВыводаБезВычисления() Экспорт

	// Подготовка
	Операция = Интерпретировать("curl --output-dir ""$DIRECTORY"" https://example.org");
	Переменные = Новый Соответствие;
	Переменные.Вставить("DIRECTORY", "computed");

	// Действие
	Результат = Новый МатериализаторОперацииCURL().Материализовать(Операция, Переменные);

	// Проверка
	Каталог = Результат.Выполнение().Операции()[0].Результат().Каталог();
	Ожидаем.Что(Каталог.ЯвляетсяЛитералом()).Равно(Ложь);

КонецПроцедуры

&Тест
Процедура ТестДолжен_СохранитьКаталогВычисленногоСтандартногоВывода() Экспорт

	// Подготовка
	Операция = Интерпретировать(
		"curl --output-dir ""$DIRECTORY"" --output ""$OUTPUT"" https://example.org");
	Переменные = Новый Соответствие;
	Переменные.Вставить("DIRECTORY", "computed");
	Переменные.Вставить("OUTPUT", "-");

	// Действие
	Результат = Новый МатериализаторОперацииCURL().Материализовать(Операция, Переменные);

	// Проверка
	Каталог = Результат.Выполнение().Операции()[0].Результат().Каталог();
	Ожидаем.Что(Каталог.ЯвляетсяЛитералом()).Равно(Ложь);

КонецПроцедуры

&Тест
Процедура ТестДолжен_СохранитьАдресАктивногоFTPДляHTTPБезВычисления() Экспорт

	// Подготовка
	Операция = Интерпретировать("curl --ftp-port ""$ADDRESS"" https://example.org");
	Переменные = Новый Соответствие;
	Переменные.Вставить("ADDRESS", "computed");

	// Действие
	Результат = Новый МатериализаторОперацииCURL().Материализовать(Операция, Переменные);

	// Проверка
	Адрес = Результат.Выполнение().Операции()[0].Соединение().АдресОбратногоСоединенияFTP();
	Ожидаем.Что(Адрес.ЯвляетсяЛитералом()).Равно(Ложь);

КонецПроцедуры

&Тест
Процедура ТестДолжен_НеВычислятьАдресFTPПриОшибочномURL() Экспорт

	// Подготовка
	Операция = Интерпретировать("curl --ftp-port ""$ADDRESS"" ""$URL""");
	Переменные = Новый Соответствие;
	Переменные.Вставить("ADDRESS", "computed");
	Переменные.Вставить("URL", "@invalid");

	// Действие
	Результат = Новый МатериализаторОперацииCURL().Материализовать(Операция, Переменные);

	// Проверка
	Ожидаем.Что(Результат.Успешно()).Равно(Ложь);
	Ожидаем.Что(Результат.Ошибки()).ИмеетДлину(1);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Интерпретировать(Текст)

	Команда = Новый КомандыДляТестовCURL().ИзСтроки(Текст);
	Возврат Новый ИнтерпретаторКомандыCURL().Интерпретировать(Команда).Выполнение().Операции()[0];

КонецФункции

#КонецОбласти
