#Использовать asserts
#Использовать "../../src/syntax"
#Использовать "../../src/domain"

#Область Тесты

&Тест
Процедура ТестДолжен_СоздатьЛитеральноеВыражение() Экспорт

	// Подготовка
	Токен = ТокенИзАргумента("example.org/path");

	// Действие
	Выражение = Новый ВыражениеЗначенияCURL(Токен);

	// Проверка
	Ожидаем.Что(Выражение.ЯвляетсяЛитералом()).Равно(Истина);
	Ожидаем.Что(Выражение.ЛитеральноеЗначение()).Равно("example.org/path");
	Ожидаем.Что(Выражение.Источник()).Равно(Токен);
	Ожидаем.Что(Выражение.Фрагменты()).ИмеетДлину(1);
	ПроверитьЧтоКоллекцияНеизменяема(Выражение.Фрагменты());

КонецПроцедуры

&Тест
Процедура ТестДолжен_СохранитьДинамическоеВыражениеБезПодстановки() Экспорт

	// Подготовка
	Токен = Новый ЛексерКомандыCURL().Разобрать("curl ""$HOST/path""").Токены()[1];

	// Действие
	Выражение = Новый ВыражениеЗначенияCURL(Токен);

	// Проверка
	Ожидаем.Что(Выражение.ЯвляетсяЛитералом()).Равно(Ложь);
	Ожидаем.Что(Выражение.ЛитеральноеЗначение()).Равно(Неопределено);
	Ожидаем.Что(Выражение.Фрагменты()).ИмеетДлину(Токен.Фрагменты().Количество());
	Для Индекс = 0 По Токен.Фрагменты().ВГраница() Цикл
		Ожидаем.Что(Выражение.Фрагменты()[Индекс].Вид).Равно(Токен.Фрагменты()[Индекс].Вид);
		Ожидаем.Что(Выражение.Фрагменты()[Индекс].Значение).Равно(Токен.Фрагменты()[Индекс].Значение);
		Ожидаем.Что(Выражение.Фрагменты()[Индекс].ИсходноеПредставление).Равно(
			Токен.Фрагменты()[Индекс].ИсходноеПредставление
		);
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура ТестДолжен_СоздатьОтложеннуюКлассификацию() Экспорт

	// Подготовка
	Токен = Новый ЛексерКомандыCURL().Разобрать("curl ""$URL""").Токены()[1];
	Источник = СоздательЭлементовРазобраннойКомандыCURL.URL(Токен);
	Выражение = Новый ВыражениеЗначенияCURL(Токен);

	// Действие
	Классификация = Новый ОтложеннаяКлассификацияCURL(
		Выражение,
		ГрамматикиЗначенийCURL.URL(),
		Источник
	);

	// Проверка
	Ожидаем.Что(Классификация.Выражение()).Равно(Выражение);
	Ожидаем.Что(Классификация.Грамматика()).Равно(ГрамматикиЗначенийCURL.URL());
	Ожидаем.Что(Классификация.Источник()).Равно(Источник);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТокенИзАргумента(Аргумент)

	Аргументы = Новый Массив;
	Аргументы.Добавить(Аргумент);
	Возврат Новый АдаптерАргументовКомандыCURL().Адаптировать(Аргументы).Токены()[0];

КонецФункции

Процедура ПроверитьЧтоКоллекцияНеизменяема(Коллекция)

	Попытка
		Коллекция.Добавить(Неопределено);
		ВызватьИсключение "Ожидалось исключение";
	Исключение
		Ожидаем.Что(ОписаниеОшибки()).Содержит("Метод объекта не обнаружен");
	КонецПопытки;

КонецПроцедуры

#КонецОбласти
