#Использовать asserts
#Использовать "../../src/shared"

#Область Тесты

&ПараметризованныйТест
&ИсточникЗначение(Ложь)
&ИсточникЗначение(Истина)
Процедура ТестДолжен_СкопироватьПорядокИСсылкиНаЭлементы(Фиксированный) Экспорт

	// Подготовка
	Элемент = Новый ФиксированнаяСтруктура("Имя", "первый");
	Массив = Новый Массив;
	Массив.Добавить(Элемент);
	Массив.Добавить(Неопределено);
	Источник = ?(Фиксированный, Новый ФиксированныйМассив(Массив), Массив);

	// Действие
	Результат = Новый КоллекцииМоделиCURL().Скопировать(Источник);
	Массив.Очистить();

	// Проверка
	Ожидаем.Что(Результат).ИмеетТип("Массив");
	Ожидаем.Что(Результат).ИмеетДлину(2);
	Ожидаем.Что(Результат[0]).Равно(Элемент);
	Ожидаем.Что(Результат[1]).Равно(Неопределено);

КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение(Ложь)
&ИсточникЗначение(Истина)
Процедура ТестДолжен_СоздатьНезависимуюИзменяемуюКопию(Фиксированный) Экспорт

	// Подготовка
	Массив = Новый Массив;
	Массив.Добавить("первый");
	Массив.Добавить("второй");
	Источник = ?(Фиксированный, Новый ФиксированныйМассив(Массив), Массив);

	// Действие
	Результат = Новый КоллекцииМоделиCURL().Скопировать(Источник);
	Результат.Удалить(0);
	Массив.Очистить();

	// Проверка
	Ожидаем.Что(Результат).ИмеетТип("Массив");
	Ожидаем.Что(Результат).ИмеетДлину(1);
	Ожидаем.Что(Результат[0]).Равно("второй");

КонецПроцедуры

#КонецОбласти
