// BSLLS:LatinAndCyrillicSymbolInWord-off

#Использовать asserts
#Использовать "../../src/syntax"
#Использовать "../../src/domain"

#Область Тесты

&Тест
Процедура ТестДолжен_ПредоставитьРазделителиЧастейТела() Экспорт

	// Действие и Проверка
	Ожидаем.Что(РазделителиЧастейТелаCURL.Нет()).Равно("none");
	Ожидаем.Что(РазделителиЧастейТелаCURL.Амперсанд()).Равно("ampersand");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПредоставитьГрамматикиЗначений() Экспорт

	// Действие
	Значения = Новый Массив;
	Значения.Добавить(ГрамматикиЗначенийCURL.URL());
	Значения.Добавить(ГрамматикиЗначенийCURL.Заголовок());
	Значения.Добавить(ГрамматикиЗначенийCURL.ЧастьЗапроса());
	Значения.Добавить(ГрамматикиЗначенийCURL.Данные());
	Значения.Добавить(ГрамматикиЗначенийCURL.ДанныеБезСсылкиНаФайл());
	Значения.Добавить(ГрамматикиЗначенийCURL.ДвоичныеДанные());
	Значения.Добавить(ГрамматикиЗначенийCURL.КодированныеДанные());
	Значения.Добавить(ГрамматикиЗначенийCURL.JSON());
	Значения.Добавить(ГрамматикиЗначенийCURL.Форма());
	Значения.Добавить(ГрамматикиЗначенийCURL.СтроковаяФорма());
	Значения.Добавить(ГрамматикиЗначенийCURL.Результат());
	Значения.Добавить(ГрамматикиЗначенийCURL.УчетныеДанные());
	Значения.Добавить(ГрамматикиЗначенийCURL.Прокси());
	Значения.Добавить(ГрамматикиЗначенийCURL.Сертификат());
	Значения.Добавить(ГрамматикиЗначенийCURL.ПользовательскийАгент());
	Значения.Добавить(ГрамматикиЗначенийCURL.ЦелоеНеотрицательное());
	Значения.Добавить(ГрамматикиЗначенийCURL.ДесятичноеНеотрицательное());

	// Проверка
	ПроверитьУникальность(Значения, 17);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПредоставитьВидыЗапросаИТела() Экспорт

	// Действие и Проверка
	ПроверитьУникальность(ЗначенияМетодовЗапроса(), 5);
	ПроверитьУникальность(ЗначенияРазделителейЗапроса(), 4);
	ПроверитьУникальность(ЗначенияИсточниковЗапроса(), 4);
	ПроверитьУникальность(ЗначенияДействийНадЗаголовками(), 7);
	ПроверитьУникальность(ЗначенияВидовТела(), 4);
	ПроверитьУникальность(ЗначенияВидовЧастейТела(), 4);
	ПроверитьУникальность(ЗначенияРежимовИсточникаТела(), 6);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПредоставитьВидыСоединенияИРезультата() Экспорт

	// Действие и Проверка
	ПроверитьУникальность(ЗначенияСпособовАутентификации(), 5);
	ПроверитьУникальность(ЗначенияФорматовЧисел(), 2);
	ПроверитьУникальность(ЗначенияСпособовАутентификацииПрокси(), 2);
	ПроверитьУникальность(ЗначенияРежимовПрокси(), 3);
	ПроверитьУникальность(ЗначенияРежимовСоединенияFTP(), 2);
	ПроверитьУникальность(ЗначенияРежимовРезультата(), 4);
	ПроверитьУникальность(ЗначенияИдентификаторовОбработчиков(), 7);
	ПроверитьУникальность(ЗначенияПротоколов(), 14);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПредоставитьПротоколы() Экспорт

	// Действие и Проверка
	Ожидаем.Что(ПротоколыCURL.HTTP()).Равно("http");
	Ожидаем.Что(ПротоколыCURL.HTTPS()).Равно("https");
	Ожидаем.Что(ПротоколыCURL.FTP()).Равно("ftp");
	Ожидаем.Что(ПротоколыCURL.FTPS()).Равно("ftps");
	Ожидаем.Что(ПротоколыCURL.FILE()).Равно("file");
	Ожидаем.Что(ПротоколыCURL.DICT()).Равно("dict");
	Ожидаем.Что(ПротоколыCURL.IMAP()).Равно("imap");
	Ожидаем.Что(ПротоколыCURL.LDAP()).Равно("ldap");
	Ожидаем.Что(ПротоколыCURL.POP3()).Равно("pop3");
	Ожидаем.Что(ПротоколыCURL.SMTP()).Равно("smtp");
	Ожидаем.Что(ПротоколыCURL.SOCKS4()).Равно("socks4");
	Ожидаем.Что(ПротоколыCURL.SOCKS4A()).Равно("socks4a");
	Ожидаем.Что(ПротоколыCURL.SOCKS5()).Равно("socks5");
	Ожидаем.Что(ПротоколыCURL.SOCKS5H()).Равно("socks5h");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьУникальность(Значения, ОжидаемоеКоличество)

	УникальныеЗначения = Новый Соответствие;
	Для Каждого Значение Из Значения Цикл
		УникальныеЗначения.Вставить(Значение, Истина);
	КонецЦикла;

	Ожидаем.Что(Значения).ИмеетДлину(ОжидаемоеКоличество);
	Ожидаем.Что(УникальныеЗначения).ИмеетДлину(ОжидаемоеКоличество);

КонецПроцедуры

Функция ЗначенияМетодовЗапроса()

	Значения = Новый Массив;
	Значения.Добавить(МетодыЗапросаПоУмолчаниюCURL.GET());
	Значения.Добавить(МетодыЗапросаПоУмолчаниюCURL.HEAD());
	Значения.Добавить(МетодыЗапросаПоУмолчаниюCURL.POST());
	Значения.Добавить(МетодыЗапросаПоУмолчаниюCURL.PUT());
	Значения.Добавить(МетодыЗапросаПоУмолчаниюCURL.ЗависитОтПротокола());
	Возврат Значения;

КонецФункции

Функция ЗначенияРазделителейЗапроса()

	Значения = Новый Массив;
	Значения.Добавить(РазделителиСтрокиЗапросаCURL.Нет());
	Значения.Добавить(РазделителиСтрокиЗапросаCURL.ВопросительныйЗнак());
	Значения.Добавить(РазделителиСтрокиЗапросаCURL.Амперсанд());
	Значения.Добавить(РазделителиСтрокиЗапросаCURL.ОпределитьПоАдресу());
	Возврат Значения;

КонецФункции

Функция ЗначенияИсточниковЗапроса()

	Значения = Новый Массив;
	Значения.Добавить(ВидыИсточниковЧастиСтрокиЗапросаCURL.Текст());
	Значения.Добавить(ВидыИсточниковЧастиСтрокиЗапросаCURL.Файл());
	Значения.Добавить(ВидыИсточниковЧастиСтрокиЗапросаCURL.СтандартныйВвод());
	Значения.Добавить(ВидыИсточниковЧастиСтрокиЗапросаCURL.ОпределитьПослеВычисления());
	Возврат Значения;

КонецФункции

Функция ЗначенияДействийНадЗаголовками()

	Значения = Новый Массив;
	Значения.Добавить(ДействияНадЗаголовкамиCURL.Установить());
	Значения.Добавить(ДействияНадЗаголовкамиCURL.ПередатьПустой());
	Значения.Добавить(ДействияНадЗаголовкамиCURL.Удалить());
	Значения.Добавить(ДействияНадЗаголовкамиCURL.ЗагрузитьИзФайла());
	Значения.Добавить(ДействияНадЗаголовкамиCURL.ЗагрузитьИзСтандартногоВвода());
	Значения.Добавить(ДействияНадЗаголовкамиCURL.УстановитьЕслиОтсутствует());
	Значения.Добавить(ДействияНадЗаголовкамиCURL.ОпределитьПослеВычисления());
	Возврат Значения;

КонецФункции

Функция ЗначенияВидовТела()

	Значения = Новый Массив;
	Значения.Добавить(ВидыТелаЗапросаCURL.Отсутствует());
	Значения.Добавить(ВидыТелаЗапросаCURL.Данные());
	Значения.Добавить(ВидыТелаЗапросаCURL.Multipart());
	Значения.Добавить(ВидыТелаЗапросаCURL.ЗагрузкаФайла());
	Возврат Значения;

КонецФункции

Функция ЗначенияВидовЧастейТела()

	Значения = Новый Массив;
	Значения.Добавить(ВидыЧастейТелаЗапросаCURL.Данные());
	Значения.Добавить(ВидыЧастейТелаЗапросаCURL.ПолеMultipart());
	Значения.Добавить(ВидыЧастейТелаЗапросаCURL.ЗагрузкаФайла());
	Значения.Добавить(ВидыЧастейТелаЗапросаCURL.ОпределитьПослеВычисления());
	Возврат Значения;

КонецФункции

Функция ЗначенияРежимовИсточникаТела()

	Значения = Новый Массив;
	Значения.Добавить(РежимыИсточникаТелаCURL.ЛитеральноеЗначение());
	Значения.Добавить(РежимыИсточникаТелаCURL.ТекстовыйФайлБезCRLFNUL());
	Значения.Добавить(РежимыИсточникаТелаCURL.ДвоичныйФайл());
	Значения.Добавить(РежимыИсточникаТелаCURL.СтандартныйВвод());
	Значения.Добавить(РежимыИсточникаТелаCURL.НеблокирующийСтандартныйВвод());
	Значения.Добавить(РежимыИсточникаТелаCURL.ОпределитьПослеВычисления());
	Возврат Значения;

КонецФункции

Функция ЗначенияСпособовАутентификации()

	Значения = Новый Массив;
	Значения.Добавить(СпособыАутентификацииCURL.Basic());
	Значения.Добавить(СпособыАутентификацииCURL.Digest());
	Значения.Добавить(СпособыАутентификацииCURL.NTLM());
	Значения.Добавить(СпособыАутентификацииCURL.Negotiate());
	Значения.Добавить(СпособыАутентификацииCURL.OAuth2Bearer());
	Возврат Значения;

КонецФункции

Функция ЗначенияФорматовЧисел()

	Значения = Новый Массив;
	Значения.Добавить(ФорматыЧисловыхЗначенийCURL.ЦелоеНеотрицательное());
	Значения.Добавить(ФорматыЧисловыхЗначенийCURL.ДесятичноеНеотрицательное());
	Возврат Значения;

КонецФункции

Функция ЗначенияСпособовАутентификацииПрокси()

	Значения = Новый Массив;
	Значения.Добавить(СпособыАутентификацииПроксиCURL.Basic());
	Значения.Добавить(СпособыАутентификацииПроксиCURL.NTLM());
	Возврат Значения;

КонецФункции

Функция ЗначенияРежимовПрокси()

	Значения = Новый Массив;
	Значения.Добавить(РежимыПроксиCURL.Отключен());
	Значения.Добавить(РежимыПроксиCURL.Настроен());
	Значения.Добавить(РежимыПроксиCURL.ОпределитьПослеВычисления());
	Возврат Значения;

КонецФункции

Функция ЗначенияРежимовСоединенияFTP()

	Значения = Новый Массив;
	Значения.Добавить(РежимыСоединенияFTPCURL.Пассивный());
	Значения.Добавить(РежимыСоединенияFTPCURL.Активный());
	Возврат Значения;

КонецФункции

Функция ЗначенияРежимовРезультата()

	Значения = Новый Массив;
	Значения.Добавить(РежимыРезультатаCURL.СтандартныйВывод());
	Значения.Добавить(РежимыРезультатаCURL.Файл());
	Значения.Добавить(РежимыРезультатаCURL.ИмяИзURL());
	Значения.Добавить(РежимыРезультатаCURL.ОпределитьПослеВычисления());
	Возврат Значения;

КонецФункции

Функция ЗначенияИдентификаторовОбработчиков()

	Значения = Новый Массив;
	Значения.Добавить(ИдентификаторыОбработчиковОпцийCURL.РесурсИРезультат());
	Значения.Добавить(ИдентификаторыОбработчиковОпцийCURL.ЗапросИЗаголовки());
	Значения.Добавить(ИдентификаторыОбработчиковОпцийCURL.Тело());
	Значения.Добавить(ИдентификаторыОбработчиковОпцийCURL.Аутентификация());
	Значения.Добавить(ИдентификаторыОбработчиковОпцийCURL.TLS());
	Значения.Добавить(ИдентификаторыОбработчиковОпцийCURL.Прокси());
	Значения.Добавить(ИдентификаторыОбработчиковОпцийCURL.СоединениеИПолитики());
	Возврат Значения;

КонецФункции

Функция ЗначенияПротоколов()

	Значения = Новый Массив;
	Значения.Добавить(ПротоколыCURL.HTTP());
	Значения.Добавить(ПротоколыCURL.HTTPS());
	Значения.Добавить(ПротоколыCURL.FTP());
	Значения.Добавить(ПротоколыCURL.FTPS());
	Значения.Добавить(ПротоколыCURL.FILE());
	Значения.Добавить(ПротоколыCURL.DICT());
	Значения.Добавить(ПротоколыCURL.IMAP());
	Значения.Добавить(ПротоколыCURL.LDAP());
	Значения.Добавить(ПротоколыCURL.POP3());
	Значения.Добавить(ПротоколыCURL.SMTP());
	Значения.Добавить(ПротоколыCURL.SOCKS4());
	Значения.Добавить(ПротоколыCURL.SOCKS4A());
	Значения.Добавить(ПротоколыCURL.SOCKS5());
	Значения.Добавить(ПротоколыCURL.SOCKS5H());
	Возврат Значения;

КонецФункции

#КонецОбласти
