#Использовать asserts
#Использовать errors
#Использовать "../../src/syntax"
#Использовать "../../src/domain"

#Область Тесты

&Тест
Процедура ТестДолжен_СоздатьНеуспешныйНеизменяемыйРезультат() Экспорт

	// Подготовка
	ИсходныеОшибки = Новый Массив;
	ИсходныеОшибки.Добавить(ФабрикаОшибок.Создать("test.error", "Тестовая ошибка"));

	// Действие
	Результат = Новый РезультатИнтерпретацииCURL(Неопределено, ИсходныеОшибки);
	ИсходныеОшибки.Очистить();

	// Проверка
	Ожидаем.Что(Результат.Успешно()).Равно(Ложь);
	Ожидаем.Что(Результат.Выполнение()).Равно(Неопределено);
	Ожидаем.Что(Результат.Ошибки()).ИмеетДлину(1);
	ПроверитьЧтоКоллекцияНеизменяема(Результат.Ошибки());

КонецПроцедуры

&Тест
Процедура ТестДолжен_ОтклонитьРезультатБезВыполненияИОшибок() Экспорт

	// Действие
	Ошибка = ПолучитьОшибкуСозданияРезультата(Неопределено, Новый Массив);

	// Проверка
	Ожидаем.Что(ДиагностикаОшибок.КодОшибки(Ошибка)).Равно(
		КодыСтандартныхОшибок.НарушенВнутреннийИнвариант()
	);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ОтклонитьВыполнениеВРезультатеСОшибками() Экспорт

	// Подготовка
	Ошибки = Новый Массив;
	Ошибки.Добавить(ФабрикаОшибок.Создать("test.error", "Тестовая ошибка"));

	// Действие
	Ошибка = ПолучитьОшибкуСозданияРезультата("описание", Ошибки);

	// Проверка
	Ожидаем.Что(ДиагностикаОшибок.КодОшибки(Ошибка)).Равно(
		КодыСтандартныхОшибок.НарушенВнутреннийИнвариант()
	);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьОшибкуСозданияРезультата(Выполнение, Ошибки)

	Попытка
		Результат = Новый РезультатИнтерпретацииCURL(Выполнение, Ошибки);
	Исключение
		Возврат ИнформацияОбОшибке();
	КонецПопытки;

	Возврат Неопределено;

КонецФункции

Процедура ПроверитьЧтоКоллекцияНеизменяема(Коллекция)

	Попытка
		Коллекция.Добавить(Неопределено);
		ВызватьИсключение "Ожидалось исключение";
	Исключение
		Ожидаем.Что(ОписаниеОшибки()).Содержит("Метод объекта не обнаружен");
	КонецПопытки;

КонецПроцедуры

#КонецОбласти
