#Использовать "../../src/core"

Процедура ВыполнитьПриложение()

	Приложение = Новый КонсольноеПриложение( "my-tests", 
		"Мое описание");
    Приложение.Версия("v version", "0.1.0");

	// Приложение.ДобавитьКоманду(
	// 	"m make", "", 
	// 	Новый );

    // Приложение.УстановитьОсновноеДействие(ЭтотОбъект);
    Приложение.Запустить(АргументыКоманднойСтроки);

КонецПроцедуры // ВыполнениеКоманды()

// Процедура ВыполнитьКоманду(Знач КомандаПриложения) Экспорт
// 	КомандаПриложения.ВывестиСправку();
// КонецПроцедуры

Попытка

    ВыполнитьПриложение();
	ЗавершитьРаботу(0);

Исключение

	Сообщить(ОписаниеОшибки());
	ЗавершитьРаботу(1);

КонецПопытки;