#Использовать errors

Перем _СервисКонвертации; // СервисКонвертацииCURL

#Область ОбработчикиСобытий

// Создаёт фасад конвертации с пользовательским либо встроенным реестром генераторов.
//
// Параметры:
//   Реестр - РеестрГенераторовCURL, Неопределено - Пользовательский реестр генераторов.
//
// Исключения:
//   argument.invalid_type - Передан реестр недопустимого типа.
Процедура ПриСозданииОбъекта(Реестр = Неопределено)

	Если Реестр = Неопределено Тогда
		Реестр = Новый РеестрГенераторовCURL;
		Реестр.Зарегистрировать(Новый ГенераторКодаПлатформыCURL);
		Реестр.Зарегистрировать(Новый ГенераторКодаКоннектораCURL);
	Иначе
		ПроверкаАргументов.ПроверитьТип("Реестр", Реестр, "РеестрГенераторовCURL");
	КонецЕсли;

	_СервисКонвертации = Новый СервисКонвертацииCURL(Реестр);

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Конвертирует команду curl выбранным генератором.
//
// Параметры:
//   Параметры - ПараметрыКонвертацииCURL - Параметры конвертации команды curl.
//
// Возвращаемое значение:
//   РезультатКонвертацииCURL - Результат конвертации.
//
// Исключения:
//   argument.invalid_type - Переданы параметры недопустимого типа.
Функция Конвертировать(Параметры) Экспорт

	ПроверкаАргументов.ПроверитьТип("Параметры", Параметры, "ПараметрыКонвертацииCURL");

	Возврат _СервисКонвертации.Конвертировать(Параметры);

КонецФункции

#КонецОбласти
