#Использовать asserts
#Использовать "../../src/generators/shared"

#Область Тесты

&Тест
Процедура ТестДолжен_ВынестиЯвноНазначеннуюПодготовку() Экспорт

	// Подготовка
	Операции = Новый Массив;
	Операции.Добавить(Новый Структура(
		"Подготовка, Выполнение",
		"Настройки = Новый Структура;",
		"Результат = Выполнить(1);"
	));
	Операции.Добавить(Новый Структура(
		"Подготовка, Выполнение",
		"Настройки = Новый Структура;",
		"Результат = Выполнить(2);"
	));

	// Действие
	Компоновка = Новый КомпоновщикОперацийCURL().ВынестиОбщуюПодготовку(Операции);

	// Проверка
	Ожидаем.Что(Компоновка.ОбщийКод).Равно("Настройки = Новый Структура;");
	Ожидаем.Что(Компоновка.Фрагменты[0]).Равно("Результат = Выполнить(1);");
	Ожидаем.Что(Компоновка.Фрагменты[1]).Равно("Результат = Выполнить(2);");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВынестиОдинаковуюНеобязательнуюПодготовку() Экспорт

	// Подготовка
	Операции = Новый Массив;
	Операции.Добавить(Новый Структура(
		"Подготовка, ПодготовкаTLS, Выполнение",
		"",
		"ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();",
		"Результат = ВыполнитьHTTP();"
	));
	Операции.Добавить(Новый Структура(
		"Подготовка, Выполнение",
		"",
		"Результат = ВыполнитьHTTPБезTLS();"
	));

	// Действие
	Компоновка = Новый КомпоновщикОперацийCURL().ВынестиОбщуюПодготовку(Операции);

	// Проверка
	Ожидаем.Что(Компоновка.ОбщийКод).Равно(
		"ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();"
	);
	Ожидаем.Что(Компоновка.Фрагменты[0]).Равно("Результат = ВыполнитьHTTP();");
	Ожидаем.Что(Компоновка.Фрагменты[1]).Равно("Результат = ВыполнитьHTTPБезTLS();");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ОставитьРазличнуюПодготовкуПроксиВОперациях() Экспорт

	// Подготовка
	Операции = Новый Массив;
	Операции.Добавить(Новый Структура(
		"Подготовка, ПодготовкаПрокси, Выполнение",
		"",
		"Прокси = ПолучитьПрокси(1);",
		"Результат = Выполнить(1);"
	));
	Операции.Добавить(Новый Структура(
		"Подготовка, ПодготовкаПрокси, Выполнение",
		"",
		"Прокси = ПолучитьПрокси(2);",
		"Результат = Выполнить(2);"
	));

	// Действие
	Компоновка = Новый КомпоновщикОперацийCURL().ВынестиОбщуюПодготовку(Операции);

	// Проверка
	Ожидаем.Что(Компоновка.ОбщийКод).Равно("");
	Ожидаем.Что(Компоновка.Фрагменты[0]).Равно(
		"Прокси = ПолучитьПрокси(1);" + Символы.ПС + Символы.ПС + "Результат = Выполнить(1);"
	);
	Ожидаем.Что(Компоновка.Фрагменты[1]).Равно(
		"Прокси = ПолучитьПрокси(2);" + Символы.ПС + Символы.ПС + "Результат = Выполнить(2);"
	);

КонецПроцедуры

&Тест
Процедура ТестДолжен_СохранитьЯвныйРазделительВыполнения() Экспорт

	// Подготовка
	Операции = Новый Массив;
	Операции.Добавить(Новый Структура(
		"Подготовка, Выполнение, РазделительВыполнения",
		"Данные = ПолучитьДанные();",
		"Результат = Выполнить();",
		Символы.ПС
	));

	// Действие
	Компоновка = Новый КомпоновщикОперацийCURL().ВынестиОбщуюПодготовку(Операции);

	// Проверка
	Ожидаем.Что(Компоновка.Фрагменты[0]).Равно(
		"Данные = ПолучитьДанные();" + Символы.ПС + "Результат = Выполнить();"
	);

КонецПроцедуры

#КонецОбласти
