#Использовать errors
#Использовать "../../src/public"
#Использовать "../../src/generation"
#Использовать "../../src/generators/platform-http"
#Использовать "."

#Область Тесты

&ПараметризованныйТест
&ИсточникJSON(Файл = "tests/fixtures/generation/МатрицаПлатформыCURL.json")
Процедура ТестДолжен_СохранитьПолныйРезультатИсходногоСценария(Сценарий) Экспорт

	// Подготовка
	Реестр = Новый РеестрГенераторовCURL;
	Реестр.Зарегистрировать(Новый ГенераторКодаПлатформыCURL);
	Валидатор = Новый ВалидаторМатрицыГенератораCURL(Реестр, "1c");

	// Действие и Проверка
	Валидатор.Проверить(Сценарий);

КонецПроцедуры

#КонецОбласти
