#Использовать errors
#Использовать "../../src/public"
#Использовать "../../src/generation"
#Использовать "../../src/generators/connector-http"
#Использовать "."

#Область Тесты

&ПараметризованныйТест
&ИсточникJSON(Файл = "tests/fixtures/generation/МатрицаКоннектораCURL.json")
Процедура ТестДолжен_СохранитьПолныйРезультатИсходногоСценария(Сценарий) Экспорт

	// Подготовка
	Реестр = Новый РеестрГенераторовCURL;
	Реестр.Зарегистрировать(Новый ГенераторКодаКоннектораCURL);
	Валидатор = Новый ВалидаторМатрицыГенератораCURL(Реестр, "connector");

	// Действие и Проверка
	Валидатор.Проверить(Сценарий);

КонецПроцедуры

#КонецОбласти
