#Использовать "../../src/syntax"
#Использовать "../../src/domain"
#Использовать "../../src/generators/shared"

#Область Тесты

&ПараметризованныйТест
&ИсточникЗначение("", "OUT", "sub/file.txt")
&ИсточникЗначение("out", """out/"" + OUT", "out/sub/file.txt")
&ИсточникЗначение("out/", """out/"" + OUT", "out/sub/file.txt")
&ИсточникЗначение("out\", """out\"" + OUT", "out\sub/file.txt")
&ИсточникЗначение("/", """/"" + OUT", "/sub/file.txt")
&ИсточникЗначение("ou""t", """ou""""t/"" + OUT", "ou""t/sub/file.txt")
&ИсточникЗначение(" ", """ /"" + OUT", " /sub/file.txt")
Процедура ТестДолжен_СоединитьЛитеральныйКаталогСИменемФайла(ПутьКаталога, ОжидаемоеВыражение, ОжидаемыйПуть) Экспорт

	// Подготовка
	Аргументы = Новый Массив;
	Аргументы.Добавить(ПутьКаталога);

	Токен = Новый АдаптерАргументовКомандыCURL().Адаптировать(Аргументы).Токены()[0];
	КаталогМодели = Новый ВыражениеЗначенияCURL(Токен);
	Выражения = Новый ГенераторВыраженийCURL("ru", Новый Соответствие);
	Код = Новый ПостроительКодаCURL(Выражения);
	OUT = "sub/file.txt";

	// Действие
	ВыражениеПути = Новый ФормированиеПутиФайлаCURL().Соединить(Код, КаталогМодели, "OUT", Выражения);
	Путь = Вычислить(ВыражениеПути);

	// Проверка
	Ожидаем.Что(Код.ПолучитьРезультат()).Равно("");
	Ожидаем.Что(ВыражениеПути).Равно(ОжидаемоеВыражение);
	Ожидаем.Что(Путь).Равно(ОжидаемыйПуть);

КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение("", "sub/file.txt")
&ИсточникЗначение("out", "out/sub/file.txt")
&ИсточникЗначение("out/", "out/sub/file.txt")
&ИсточникЗначение("out\", "out\sub/file.txt")
&ИсточникЗначение("/", "/sub/file.txt")
&ИсточникЗначение("ou""t", "ou""t/sub/file.txt")
&ИсточникЗначение(" ", " /sub/file.txt")
Процедура ТестДолжен_СоединитьКаталогИзПеременнойСИменемФайла(ПутьКаталога, ОжидаемыйПуть) Экспорт

	// Подготовка
	Токен = Новый ЛексерКомандыCURL().Разобрать("curl $DIR").Токены()[1];
	КаталогМодели = Новый ВыражениеЗначенияCURL(Токен);
	Выражения = Новый ГенераторВыраженийCURL("ru", Новый Соответствие);
	Код = Новый ПостроительКодаCURL(Выражения);
	DIR = ПутьКаталога;
	OUT = "sub/file.txt";
	Каталог = Неопределено;

	ОжидаемыйКод = "Каталог = DIR;
	|Если Каталог <> """" И Прав(Каталог, 1) <> ""/"" И Прав(Каталог, 1) <> ""\"" Тогда
	|	Каталог = Каталог + ""/"";
	|КонецЕсли;";

	// Действие
	ВыражениеПути = Новый ФормированиеПутиФайлаCURL().Соединить(Код, КаталогМодели, "OUT", Выражения);
	Выполнить(Код.ПолучитьРезультат());
	Путь = Вычислить(ВыражениеПути);

	// Проверка
	Ожидаем.Что(Код.ПолучитьРезультат()).Равно(ОжидаемыйКод);
	Ожидаем.Что(ВыражениеПути).Равно("Каталог + OUT");
	Ожидаем.Что(Путь).Равно(ОжидаемыйПуть);

КонецПроцедуры

#КонецОбласти
