#Использовать 1connector
#Использовать asserts
#Использовать tempfiles

&ТестовыйНабор(Характер = "Одиночка")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

#Область Тесты

&Тест
Процедура ТестДолжен_ИспользоватьПортИзНастроекCurlone() Экспорт

	// Подготовка
	Порт = 43435;
	КаталогНастроек = ВременныеФайлы.СоздатьКаталог();
	ЗаписатьНастройки(КаталогНастроек, Порт);
	ПроцессВебСервера = СоздатьПроцесс(КомандаЗапуска("serve"), КаталогНастроек);

	Попытка
		ПроцессВебСервера.Запустить();

		// Действие
		Ответ = ДождатьсяОтвета(ПроцессВебСервера, Порт);

		// Проверка
		Ожидаем.Что(Ответ.КодСостояния, "Код ответа веб-интерфейса").Равно(200);
	Исключение
		ОстановитьПроцесс(ПроцессВебСервера);
		ВременныеФайлы.УдалитьФайл(КаталогНастроек);

		ВызватьИсключение;
	КонецПопытки;

	ОстановитьПроцесс(ПроцессВебСервера);
	ВременныеФайлы.УдалитьФайл(КаталогНастроек);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПредпочестьПортКоманднойСтроки() Экспорт

	// Подготовка
	ПортНастроек = 43435;
	ПортКоманднойСтроки = 43436;
	КаталогНастроек = ВременныеФайлы.СоздатьКаталог();
	ЗаписатьНастройки(КаталогНастроек, ПортНастроек);
	Команда = "serve --port " + ПортКоманднойСтроки;
	ПроцессВебСервера = СоздатьПроцесс(КомандаЗапуска(Команда), КаталогНастроек);

	Попытка
		ПроцессВебСервера.Запустить();

		// Действие
		Ответ = ДождатьсяОтвета(ПроцессВебСервера, ПортКоманднойСтроки);

		// Проверка
		Ожидаем.Что(Ответ.КодСостояния, "Код ответа веб-интерфейса").Равно(200);
	Исключение
		ОстановитьПроцесс(ПроцессВебСервера);
		ВременныеФайлы.УдалитьФайл(КаталогНастроек);

		ВызватьИсключение;
	КонецПопытки;

	ОстановитьПроцесс(ПроцессВебСервера);
	ВременныеФайлы.УдалитьФайл(КаталогНастроек);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КомандаЗапуска(Аргументы)

	ПутьКГлавномуСценарию = Новый Файл(
		ОбъединитьПути(ТекущийСценарий().Каталог, "../../src/main.os")
	).ПолноеИмя;

	Возврат "oscript """ + ПутьКГлавномуСценарию + """ " + Аргументы;

КонецФункции

Функция ДождатьсяОтвета(ПроцессВебСервера, Порт)

	ТаймаутОжидания = 10; // Секунд
	ЗадержкаМеждуПопытками = 100; // Миллисекунд
	ВремяНачала = ТекущаяУниверсальнаяДата();
	URL = "http://127.0.0.1:" + Порт;

	Пока Истина Цикл

		Если ПроцессВебСервера.Завершен Тогда
			ВызватьИсключение СтрШаблон(
				"Веб-сервер завершился во время запуска с кодом %1.",
				ПроцессВебСервера.КодВозврата
			);
		КонецЕсли;

		Попытка
			Возврат КоннекторHTTP.Get(URL, Новый Структура("Таймаут", ТаймаутОжидания));
		Исключение
		КонецПопытки;

		Если ТекущаяУниверсальнаяДата() - ВремяНачала > ТаймаутОжидания Тогда
			ВызватьИсключение "Не удалось запустить веб-сервер в течение 10 сек.";
		КонецЕсли;

		Приостановить(ЗадержкаМеждуПопытками);

	КонецЦикла;

КонецФункции

Процедура ОстановитьПроцесс(ПроцессВебСервера)

	Если Не ПроцессВебСервера.Завершен Тогда
		ПроцессВебСервера.Завершить();
	КонецЕсли;

КонецПроцедуры

Процедура ЗаписатьНастройки(КаталогНастроек, Порт)

	ПутьКНастройкам = ОбъединитьПути(КаталогНастроек, "autumn-properties.json");
	ТекстНастроек = "{
	|  ""curlone"": {
	|    ""web"": {
	|      ""Порт"": " + Порт + "
	|    }
	|  }
	|}";
	Запись = Новый ЗаписьТекста(ПутьКНастройкам, КодировкаТекста.UTF8);
	Запись.Записать(ТекстНастроек);
	Запись.Закрыть();

КонецПроцедуры

#КонецОбласти
