#Использовать asserts
#Использовать "../../src/web"

#Область Тесты

&Тест
Процедура ТестДолжен_ИспользоватьОбъявленныйРазмерНеподготовленногоТела() Экспорт

	// Подготовка
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Length", "65537");
	Запрос = Новый Структура("Заголовки,Тело,ТелоДвоичныеДанные", Заголовки, "", Неопределено);

	// Действие
	Размер = Новый ПроверкаЗапросаКонвертацииJSON().РазмерТела(Запрос);

	// Проверка
	Ожидаем.Что(Размер).Равно(65537);

КонецПроцедуры

#КонецОбласти
