#Использовать "../../shared"

Перем _УчетныеДанные; // УчетныеДанныеCURL, Неопределено
Перем _Способы; // ФиксированныйМассив из СпособАутентификацииCURL
Перем _OAuth2; // ТокенOAuth2CURL, Неопределено
Перем _ПодписьAWSV4; // ПараметрыПодписиAWSV4CURL, Неопределено

#Область ОбработчикиСобытий

// Создаёт настройки аутентификации curl.
//
// Параметры:
//   Способы - Массив, ФиксированныйМассив из СпособАутентификацииCURL - Способы аутентификации.
//   УчетныеДанные - УчетныеДанныеCURL, Неопределено - Учётные данные.
//   OAuth2 - ТокенOAuth2CURL, Неопределено - Токен OAuth2.
//   ПодписьAWSV4 - ПараметрыПодписиAWSV4CURL, Неопределено - Параметры подписи.
Процедура ПриСозданииОбъекта(Способы, УчетныеДанные = Неопределено, OAuth2 = Неопределено, ПодписьAWSV4 = Неопределено)
	
	_УчетныеДанные = УчетныеДанные;
	_Способы = ?(
		ПодписьAWSV4 = Неопределено,
		Новый ФиксированныйМассив(КоллекцииМоделиCURL.Скопировать(Способы)),
		Новый ФиксированныйМассив(Новый Массив)
	);
	_OAuth2 = OAuth2;
	_ПодписьAWSV4 = ПодписьAWSV4;

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает учётные данные.
//
// Возвращаемое значение:
//   УчетныеДанныеCURL, Неопределено - Учётные данные или Неопределено.
Функция УчетныеДанные() Экспорт
	Возврат _УчетныеДанные;
КонецФункции

// Возвращает способы аутентификации.
//
// Возвращаемое значение:
//   ФиксированныйМассив из СпособАутентификацииCURL - Способы аутентификации.
Функция Способы() Экспорт
	Возврат _Способы;
КонецФункции

// Возвращает токен OAuth2.
//
// Возвращаемое значение:
//   ТокенOAuth2CURL, Неопределено - Токен или Неопределено.
Функция OAuth2() Экспорт
	Возврат _OAuth2;
КонецФункции

// Возвращает параметры подписи AWS V4.
//
// Возвращаемое значение:
//   ПараметрыПодписиAWSV4CURL, Неопределено - Параметры или Неопределено.
Функция ПодписьAWSV4() Экспорт
	Возврат _ПодписьAWSV4;
КонецФункции

#КонецОбласти
