Перем _Ресурс; // АдресПередачиCURL
Перем _УчетныеДанные; // УчетныеДанныеCURL, Неопределено
Перем _РазделительПередПервойЧастью; // Строка

#Область ОбработчикиСобытий

// Создаёт классифицированный адрес передачи.
//
// Параметры:
//   Ресурс - АдресПередачиCURL - Адрес ресурса.
//   УчетныеДанные - УчетныеДанныеCURL, Неопределено - Данные из URL.
//   РазделительПередПервойЧастью - Строка - Значение из РазделителиСтрокиЗапросаCURL.
Процедура ПриСозданииОбъекта(Ресурс, УчетныеДанные, РазделительПередПервойЧастью)
	_Ресурс = Ресурс;
	_УчетныеДанные = УчетныеДанные;
	_РазделительПередПервойЧастью = РазделительПередПервойЧастью;
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает ресурс.
//
// Возвращаемое значение:
//   АдресПередачиCURL - Адрес ресурса.
Функция Ресурс() Экспорт
	Возврат _Ресурс;
КонецФункции

// Возвращает учётные данные.
//
// Возвращаемое значение:
//   УчетныеДанныеCURL, Неопределено - Данные из URL.
Функция УчетныеДанные() Экспорт
	Возврат _УчетныеДанные;
КонецФункции

// Возвращает разделитель перед первой новой частью запроса.
//
// Возвращаемое значение:
//   Строка - Значение из РазделителиСтрокиЗапросаCURL.
Функция РазделительПередПервойЧастью() Экспорт
	Возврат _РазделительПередПервойЧастью;
КонецФункции

#КонецОбласти
