Перем _СертификатКлиента; // СертификатКлиентаCURL, Неопределено
Перем _СертификатыУдостоверяющегоЦентра; // ВыражениеЗначенияCURL, Неопределено
Перем _ИспользоватьСистемноеХранилище; // Булево
Перем _ИсточникСертификата; // ЭлементРазобраннойКомандыCURL, Неопределено
Перем _ИсточникСертификатовУдостоверяющегоЦентра; // ЭлементРазобраннойКомандыCURL, Неопределено
Перем _ИсточникСистемногоХранилища; // ЭлементРазобраннойКомандыCURL, Неопределено

#Область ОбработчикиСобытий

// Создаёт настройки TLS.
//
// Параметры:
//   СертификатКлиента - СертификатКлиентаCURL, Неопределено - СертификатКлиента.
//   СертификатыУдостоверяющегоЦентра - ВыражениеЗначенияCURL, Неопределено - СертификатыУдостоверяющегоЦентра.
//   ИспользоватьСистемноеХранилище - Булево - ИспользоватьСистемноеХранилище.
//   ИсточникСертификата - ЭлементРазобраннойКомандыCURL, Неопределено - ИсточникСертификата.
//   ИсточникСертификатовУдостоверяющегоЦентра - ЭлементРазобраннойКомандыCURL, Неопределено
//     ИсточникСертификатовУдостоверяющегоЦентра.
//   ИсточникСистемногоХранилища - ЭлементРазобраннойКомандыCURL, Неопределено - ИсточникСистемногоХранилища.
Процедура ПриСозданииОбъекта(
	СертификатКлиента,
	СертификатыУдостоверяющегоЦентра,
	ИспользоватьСистемноеХранилище,
	ИсточникСертификата,
	ИсточникСертификатовУдостоверяющегоЦентра,
	ИсточникСистемногоХранилища
)

	_СертификатКлиента = СертификатКлиента;
	_СертификатыУдостоверяющегоЦентра = СертификатыУдостоверяющегоЦентра;
	_ИспользоватьСистемноеХранилище = ИспользоватьСистемноеХранилище;
	_ИсточникСертификата = ИсточникСертификата;
	_ИсточникСертификатовУдостоверяющегоЦентра = ИсточникСертификатовУдостоверяющегоЦентра;
	_ИсточникСистемногоХранилища = ИсточникСистемногоХранилища;

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает СертификатКлиента.
//
// Возвращаемое значение:
//   СертификатКлиентаCURL, Неопределено - СертификатКлиента.
Функция СертификатКлиента() Экспорт

	Возврат _СертификатКлиента;

КонецФункции

// Возвращает СертификатыУдостоверяющегоЦентра.
//
// Возвращаемое значение:
//   ВыражениеЗначенияCURL, Неопределено - СертификатыУдостоверяющегоЦентра.
Функция СертификатыУдостоверяющегоЦентра() Экспорт

	Возврат _СертификатыУдостоверяющегоЦентра;

КонецФункции

// Возвращает ИспользоватьСистемноеХранилище.
//
// Возвращаемое значение:
//   Булево - ИспользоватьСистемноеХранилище.
Функция ИспользоватьСистемноеХранилище() Экспорт

	Возврат _ИспользоватьСистемноеХранилище;

КонецФункции

// Возвращает ИсточникСертификата.
//
// Возвращаемое значение:
//   ЭлементРазобраннойКомандыCURL, Неопределено - ИсточникСертификата.
Функция ИсточникСертификата() Экспорт

	Возврат _ИсточникСертификата;

КонецФункции

// Возвращает ИсточникСертификатовУдостоверяющегоЦентра.
//
// Возвращаемое значение:
//   ЭлементРазобраннойКомандыCURL, Неопределено - ИсточникСертификатовУдостоверяющегоЦентра.
Функция ИсточникСертификатовУдостоверяющегоЦентра() Экспорт

	Возврат _ИсточникСертификатовУдостоверяющегоЦентра;

КонецФункции

// Возвращает ИсточникСистемногоХранилища.
//
// Возвращаемое значение:
//   ЭлементРазобраннойКомандыCURL, Неопределено - ИсточникСистемногоХранилища.
Функция ИсточникСистемногоХранилища() Экспорт

	Возврат _ИсточникСистемногоХранилища;

КонецФункции

#КонецОбласти
