Перем _TLS; // НастройкиTLSCURL
Перем _Прокси; // ПроксиCURL
Перем _Таймаут; // ЧисловоеЗначениеCURL, Неопределено
Перем _ТаймаутСоединения; // ЧисловоеЗначениеCURL, Неопределено
Перем _РежимFTP; // Строка
Перем _АдресОбратногоСоединенияFTP; // ВыражениеЗначенияCURL, Неопределено

#Область ОбработчикиСобытий

// Создаёт неизменяемое описание соединения.
//
// Параметры:
//   TLS - НастройкиTLSCURL - Настройки TLS.
//   Прокси - ПроксиCURL - Настройки прокси.
//   Таймаут - ЧисловоеЗначениеCURL, Неопределено - Общий предел времени.
//   ТаймаутСоединения - ЧисловоеЗначениеCURL, Неопределено - Предел установления соединения.
//   РежимFTP - Строка - Значение РежимыСоединенияFTPCURL.
//   АдресОбратногоСоединенияFTP - ВыражениеЗначенияCURL, Неопределено - Адрес активного FTP.
Процедура ПриСозданииОбъекта(
	TLS,
	Прокси,
	Таймаут,
	ТаймаутСоединения,
	РежимFTP,
	АдресОбратногоСоединенияFTP
)

	_TLS = TLS;
	_Прокси = Прокси;
	_Таймаут = Таймаут;
	_ТаймаутСоединения = ТаймаутСоединения;
	_РежимFTP = РежимFTP;
	_АдресОбратногоСоединенияFTP = АдресОбратногоСоединенияFTP;

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Настройки TLS.
//
// Возвращаемое значение:
//   НастройкиTLSCURL - Настройки TLS.
Функция TLS() Экспорт

	Возврат _TLS;

КонецФункции

// Настройки прокси.
//
// Возвращаемое значение:
//   ПроксиCURL - Настройки прокси.
Функция Прокси() Экспорт

	Возврат _Прокси;

КонецФункции

// Общий предел времени.
//
// Возвращаемое значение:
//   ЧисловоеЗначениеCURL, Неопределено - Общий предел времени.
Функция Таймаут() Экспорт

	Возврат _Таймаут;

КонецФункции

// Предел установления соединения.
//
// Возвращаемое значение:
//   ЧисловоеЗначениеCURL, Неопределено - Предел установления соединения.
Функция ТаймаутСоединения() Экспорт

	Возврат _ТаймаутСоединения;

КонецФункции

// Значение РежимыСоединенияFTPCURL.
//
// Возвращаемое значение:
//   Строка - Значение РежимыСоединенияFTPCURL.
Функция РежимFTP() Экспорт

	Возврат _РежимFTP;

КонецФункции

// Адрес активного FTP.
//
// Возвращаемое значение:
//   ВыражениеЗначенияCURL, Неопределено - Адрес активного FTP.
Функция АдресОбратногоСоединенияFTP() Экспорт

	Возврат _АдресОбратногоСоединенияFTP;

КонецФункции

#КонецОбласти

