#Использовать "../../shared"

Перем _ИмяПоля; // Строка, Неопределено
Перем _ИмяФайла; // Строка, Неопределено
Перем _MIMEТип; // Строка, Неопределено
Перем _Заголовки; // ФиксированныйМассив из ОперацияНадЗаголовкомCURL

#Область ОбработчикиСобытий

// Описывает неизменяемое поле тела, включая имя кодированных данных и заголовки формы.
//
// Параметры:
//   ИмяПоля - Строка, Неопределено - Имя поля формы или кодированных данных.
//   ИмяФайла - Строка, Неопределено - Передаваемое имя файла.
//   MIMEТип - Строка, Неопределено - Тип содержимого.
//   Заголовки - Массив, ФиксированныйМассив - Заголовки части, созданные классификатором.
Процедура ПриСозданииОбъекта(ИмяПоля, ИмяФайла, MIMEТип, Заголовки)

	_ИмяПоля = ИмяПоля;
	_ИмяФайла = ИмяФайла;
	_MIMEТип = MIMEТип;
	
	_Заголовки = Новый ФиксированныйМассив(КоллекцииМоделиCURL.Скопировать(Заголовки));

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Имя поля формы или кодированных данных.
//
// Возвращаемое значение:
//   Строка, Неопределено - Имя поля формы или кодированных данных.
Функция ИмяПоля() Экспорт

	Возврат _ИмяПоля;

КонецФункции

// Передаваемое имя файла.
//
// Возвращаемое значение:
//   Строка, Неопределено - Передаваемое имя файла.
Функция ИмяФайла() Экспорт

	Возврат _ИмяФайла;

КонецФункции

// Тип содержимого.
//
// Возвращаемое значение:
//   Строка, Неопределено - Тип содержимого.
Функция MIMEТип() Экспорт

	Возврат _MIMEТип;

КонецФункции

// Заголовки части, созданные классификатором.
//
// Возвращаемое значение:
//   ФиксированныйМассив из ОперацияНадЗаголовкомCURL - Заголовки части, созданные классификатором.
Функция Заголовки() Экспорт

	Возврат _Заголовки;

КонецФункции

#КонецОбласти
