#Использовать "../../shared"

Перем _Операции; // ФиксированныйМассив из ОперацияCURL

#Область ОбработчикиСобытий

// Создаёт неизменяемое описание выполнения.
//
// Параметры:
//   Операции - Массив, ФиксированныйМассив из ОперацияCURL - Операции в исходном порядке.
Процедура ПриСозданииОбъекта(Операции)

	_Операции = Новый ФиксированныйМассив(Новый КоллекцииМоделиCURL().Скопировать(Операции));

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Операции в исходном порядке.
//
// Возвращаемое значение:
//   ФиксированныйМассив из ОперацияCURL - Операции в исходном порядке.
Функция Операции() Экспорт

	Возврат _Операции;

КонецФункции

#КонецОбласти
