Перем _Ресурс; // РесурсCURL
Перем _Запрос; // ЗапросCURL
Перем _Соединение; // СоединениеCURL
Перем _Политики; // ПолитикиПередачиCURL
Перем _Результат; // ОписаниеРезультатаCURL

#Область ОбработчикиСобытий

// Создаёт неизменяемое операцию передачи.
//
// Параметры:
//   Ресурс - РесурсCURL - Ресурс передачи.
//   Запрос - ЗапросCURL - Параметры запроса.
//   Соединение - СоединениеCURL - Параметры соединения.
//   Политики - ПолитикиПередачиCURL - Политики передачи.
//   Результат - ОписаниеРезультатаCURL - Назначение результата.
Процедура ПриСозданииОбъекта(
	Ресурс,
	Запрос,
	Соединение,
	Политики,
	Результат
)

	_Ресурс = Ресурс;
	_Запрос = Запрос;
	_Соединение = Соединение;
	_Политики = Политики;
	_Результат = Результат;

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Ресурс передачи.
//
// Возвращаемое значение:
//   РесурсCURL - Ресурс передачи.
Функция Ресурс() Экспорт

	Возврат _Ресурс;

КонецФункции

// Параметры запроса.
//
// Возвращаемое значение:
//   ЗапросCURL - Параметры запроса.
Функция Запрос() Экспорт

	Возврат _Запрос;

КонецФункции

// Параметры соединения.
//
// Возвращаемое значение:
//   СоединениеCURL - Параметры соединения.
Функция Соединение() Экспорт

	Возврат _Соединение;

КонецФункции

// Политики передачи.
//
// Возвращаемое значение:
//   ПолитикиПередачиCURL - Политики передачи.
Функция Политики() Экспорт

	Возврат _Политики;

КонецФункции

// Назначение результата.
//
// Возвращаемое значение:
//   ОписаниеРезультатаCURL - Назначение результата.
Функция Результат() Экспорт

	Возврат _Результат;

КонецФункции

#КонецОбласти

