Перем _Количество; // ЧисловоеЗначениеCURL, Неопределено
Перем _МаксимальноеВремя; // ЧисловоеЗначениеCURL, Неопределено

#Область ОбработчикиСобытий

// Создаёт политику повторов.
//
// Параметры:
//   Количество - ЧисловоеЗначениеCURL, Неопределено - Количество.
//   МаксимальноеВремя - ЧисловоеЗначениеCURL, Неопределено - МаксимальноеВремя.
Процедура ПриСозданииОбъекта(Количество, МаксимальноеВремя)

	_Количество = Количество;
	_МаксимальноеВремя = МаксимальноеВремя;

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает Количество.
//
// Возвращаемое значение:
//   ЧисловоеЗначениеCURL, Неопределено - Количество.
Функция Количество() Экспорт

	Возврат _Количество;

КонецФункции

// Возвращает МаксимальноеВремя.
//
// Возвращаемое значение:
//   ЧисловоеЗначениеCURL, Неопределено - МаксимальноеВремя.
Функция МаксимальноеВремя() Экспорт

	Возврат _МаксимальноеВремя;

КонецФункции

#КонецОбласти
