Перем _Следовать; // Булево
Перем _Источник; // ЭлементРазобраннойКомандыCURL, Неопределено

#Область ОбработчикиСобытий

// Создаёт политику перенаправлений.
//
// Параметры:
//   Следовать - Булево - Следовать.
//   Источник - ЭлементРазобраннойКомандыCURL, Неопределено - Источник.
Процедура ПриСозданииОбъекта(Следовать, Источник)

	_Следовать = Следовать;
	_Источник = Источник;

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает Следовать.
//
// Возвращаемое значение:
//   Булево - Следовать.
Функция Следовать() Экспорт

	Возврат _Следовать;

КонецФункции

// Возвращает Источник.
//
// Возвращаемое значение:
//   ЭлементРазобраннойКомандыCURL, Неопределено - Источник.
Функция Источник() Экспорт

	Возврат _Источник;

КонецФункции

#КонецОбласти
