Перем _Перенаправления; // ПолитикаПеренаправленийCURL
Перем _Повторы; // ПолитикаПовторовCURL

#Область ОбработчикиСобытий

// Создаёт неизменяемое политики передачи.
//
// Параметры:
//   Перенаправления - ПолитикаПеренаправленийCURL - Следование перенаправлениям.
//   Повторы - ПолитикаПовторовCURL - Повторы передачи.
Процедура ПриСозданииОбъекта(Перенаправления, Повторы)

	_Перенаправления = Перенаправления;
	_Повторы = Повторы;

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Следование перенаправлениям.
//
// Возвращаемое значение:
//   ПолитикаПеренаправленийCURL - Следование перенаправлениям.
Функция Перенаправления() Экспорт

	Возврат _Перенаправления;

КонецФункции

// Повторы передачи.
//
// Возвращаемое значение:
//   ПолитикаПовторовCURL - Повторы передачи.
Функция Повторы() Экспорт

	Возврат _Повторы;

КонецФункции

#КонецОбласти

