#Использовать "../../shared"

Перем _Режим; // Строка
Перем _Адрес; // ВыражениеЗначенияCURL, Неопределено
Перем _Протокол; // Строка, Неопределено
Перем _Сервер; // Строка, Неопределено
Перем _Порт; // Число, Неопределено
Перем _ПутьUnixСокета; // Строка, Неопределено
Перем _УчетныеДанные; // УчетныеДанныеCURL, Неопределено
Перем _СпособыАутентификации; // ФиксированныйМассив из СпособАутентификацииПроксиCURL
Перем _ОтложеннаяКлассификация; // ОтложеннаяКлассификацияCURL, Неопределено
Перем _ТребуетРазбора; // Булево
Перем _ИсточникАдреса; // ЭлементРазобраннойКомандыCURL, Неопределено
Перем _ИсточникУчетныхДанных; // ЭлементРазобраннойКомандыCURL, Неопределено

#Область ОбработчикиСобытий

// Создаёт настройки прокси.
//
// Параметры:
//   Режим - Строка - Режим.
//   Адрес - ВыражениеЗначенияCURL, Неопределено - Адрес.
//   Протокол - Строка, Неопределено - Протокол.
//   Сервер - Строка, Неопределено - Сервер.
//   Порт - Число, Неопределено - Порт.
//   ПутьUnixСокета - Строка, Неопределено - ПутьUnixСокета.
//   УчетныеДанные - УчетныеДанныеCURL, Неопределено - УчетныеДанные.
//   СпособыАутентификации - Массив, ФиксированныйМассив из СпособАутентификацииПроксиCURL - СпособыАутентификации.
//   ОтложеннаяКлассификация - ОтложеннаяКлассификацияCURL, Неопределено - ОтложеннаяКлассификация.
//   ТребуетРазбора - Булево - ТребуетРазбора.
//   ИсточникАдреса - ЭлементРазобраннойКомандыCURL, Неопределено - ИсточникАдреса.
//   ИсточникУчетныхДанных - ЭлементРазобраннойКомандыCURL, Неопределено - ИсточникУчетныхДанных.
Процедура ПриСозданииОбъекта(
	Режим,
	Адрес,
	Протокол,
	Сервер,
	Порт,
	ПутьUnixСокета,
	УчетныеДанные,
	СпособыАутентификации,
	ОтложеннаяКлассификация,
	ТребуетРазбора,
	ИсточникАдреса,
	ИсточникУчетныхДанных
)

	_Режим = Режим;
	_Адрес = Адрес;
	_Протокол = Протокол;
	_Сервер = Сервер;
	_Порт = Порт;
	_ПутьUnixСокета = ПутьUnixСокета;
	_УчетныеДанные = УчетныеДанные;
	_СпособыАутентификации = Новый ФиксированныйМассив(КоллекцииМоделиCURL.Скопировать(СпособыАутентификации));
	_ОтложеннаяКлассификация = ОтложеннаяКлассификация;
	_ТребуетРазбора = ТребуетРазбора;
	_ИсточникАдреса = ИсточникАдреса;
	_ИсточникУчетныхДанных = ИсточникУчетныхДанных;

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает Режим.
//
// Возвращаемое значение:
//   Строка - Режим.
Функция Режим() Экспорт

	Возврат _Режим;

КонецФункции

// Возвращает Адрес.
//
// Возвращаемое значение:
//   ВыражениеЗначенияCURL, Неопределено - Адрес.
Функция Адрес() Экспорт

	Возврат _Адрес;

КонецФункции

// Возвращает Протокол.
//
// Возвращаемое значение:
//   Строка, Неопределено - Протокол.
Функция Протокол() Экспорт

	Возврат _Протокол;

КонецФункции

// Возвращает Сервер.
//
// Возвращаемое значение:
//   Строка, Неопределено - Сервер.
Функция Сервер() Экспорт

	Возврат _Сервер;

КонецФункции

// Возвращает Порт.
//
// Возвращаемое значение:
//   Число, Неопределено - Порт.
Функция Порт() Экспорт

	Возврат _Порт;

КонецФункции

// Возвращает ПутьUnixСокета.
//
// Возвращаемое значение:
//   Строка, Неопределено - ПутьUnixСокета.
Функция ПутьUnixСокета() Экспорт

	Возврат _ПутьUnixСокета;

КонецФункции

// Возвращает УчетныеДанные.
//
// Возвращаемое значение:
//   УчетныеДанныеCURL, Неопределено - УчетныеДанные.
Функция УчетныеДанные() Экспорт

	Возврат _УчетныеДанные;

КонецФункции

// Возвращает СпособыАутентификации.
//
// Возвращаемое значение:
//   ФиксированныйМассив из СпособАутентификацииПроксиCURL - СпособыАутентификации.
Функция СпособыАутентификации() Экспорт

	Возврат _СпособыАутентификации;

КонецФункции

// Возвращает ОтложеннаяКлассификация.
//
// Возвращаемое значение:
//   ОтложеннаяКлассификацияCURL, Неопределено - ОтложеннаяКлассификация.
Функция ОтложеннаяКлассификация() Экспорт

	Возврат _ОтложеннаяКлассификация;

КонецФункции

// Возвращает ТребуетРазбора.
//
// Возвращаемое значение:
//   Булево - ТребуетРазбора.
Функция ТребуетРазбора() Экспорт

	Возврат _ТребуетРазбора;

КонецФункции

// Возвращает ИсточникАдреса.
//
// Возвращаемое значение:
//   ЭлементРазобраннойКомандыCURL, Неопределено - ИсточникАдреса.
Функция ИсточникАдреса() Экспорт

	Возврат _ИсточникАдреса;

КонецФункции

// Возвращает ИсточникУчетныхДанных.
//
// Возвращаемое значение:
//   ЭлементРазобраннойКомандыCURL, Неопределено - ИсточникУчетныхДанных.
Функция ИсточникУчетныхДанных() Экспорт

	Возврат _ИсточникУчетныхДанных;

КонецФункции

#КонецОбласти
