Перем _Выражение; // ВыражениеЗначенияCURL
Перем _Путь; // Строка, Неопределено
Перем _Пароль; // Строка, Неопределено
Перем _ПарольУказан; // Булево
Перем _ТребуетРазбора; // Булево
Перем _Источник; // ЭлементРазобраннойКомандыCURL

#Область ОбработчикиСобытий

// Создаёт описание сертификата клиента.
//
// Параметры:
//   Выражение - ВыражениеЗначенияCURL - Выражение.
//   Путь - Строка, Неопределено - Путь.
//   Пароль - Строка, Неопределено - Пароль.
//   ПарольУказан - Булево - ПарольУказан.
//   ТребуетРазбора - Булево - ТребуетРазбора.
//   Источник - ЭлементРазобраннойКомандыCURL - Источник.
Процедура ПриСозданииОбъекта(
	Выражение,
	Путь,
	Пароль,
	ПарольУказан,
	ТребуетРазбора,
	Источник
)

	_Выражение = Выражение;
	_Путь = Путь;
	_Пароль = Пароль;
	_ПарольУказан = ПарольУказан;
	_ТребуетРазбора = ТребуетРазбора;
	_Источник = Источник;

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает Выражение.
//
// Возвращаемое значение:
//   ВыражениеЗначенияCURL - Выражение.
Функция Выражение() Экспорт

	Возврат _Выражение;

КонецФункции

// Возвращает Путь.
//
// Возвращаемое значение:
//   Строка, Неопределено - Путь.
Функция Путь() Экспорт

	Возврат _Путь;

КонецФункции

// Возвращает Пароль.
//
// Возвращаемое значение:
//   Строка, Неопределено - Пароль.
Функция Пароль() Экспорт

	Возврат _Пароль;

КонецФункции

// Возвращает ПарольУказан.
//
// Возвращаемое значение:
//   Булево - ПарольУказан.
Функция ПарольУказан() Экспорт

	Возврат _ПарольУказан;

КонецФункции

// Возвращает ТребуетРазбора.
//
// Возвращаемое значение:
//   Булево - ТребуетРазбора.
Функция ТребуетРазбора() Экспорт

	Возврат _ТребуетРазбора;

КонецФункции

// Возвращает Источник.
//
// Возвращаемое значение:
//   ЭлементРазобраннойКомандыCURL - Источник.
Функция Источник() Экспорт

	Возврат _Источник;

КонецФункции

#КонецОбласти
