Перем _РежимИсточника; // Строка
Перем _Выражение; // ВыражениеЗначенияCURL
Перем _Текст; // Строка, Неопределено
Перем _ПутьКФайлу; // Строка, Неопределено

#Область ОбработчикиСобытий

// Описывает неизменяемое содержимое части тела без чтения файлов.
//
// Параметры:
//   РежимИсточника - Строка - Способ получения содержимого.
//   Выражение - ВыражениеЗначенияCURL - Исходное выражение.
//   Текст - Строка, Неопределено - Литеральное содержимое.
//   ПутьКФайлу - Строка, Неопределено - Путь без чтения файла.
Процедура ПриСозданииОбъекта(РежимИсточника, Выражение, Текст, ПутьКФайлу)

	_РежимИсточника = РежимИсточника;
	_Выражение = Выражение;
	_Текст = Текст;
	_ПутьКФайлу = ПутьКФайлу;

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Способ получения содержимого.
//
// Возвращаемое значение:
//   Строка - Способ получения содержимого.
Функция РежимИсточника() Экспорт

	Возврат _РежимИсточника;

КонецФункции

// Исходное выражение.
//
// Возвращаемое значение:
//   ВыражениеЗначенияCURL - Исходное выражение.
Функция Выражение() Экспорт

	Возврат _Выражение;

КонецФункции

// Литеральное содержимое.
//
// Возвращаемое значение:
//   Строка, Неопределено - Литеральное содержимое.
Функция Текст() Экспорт

	Возврат _Текст;

КонецФункции

// Путь без чтения файла.
//
// Возвращаемое значение:
//   Строка, Неопределено - Путь без чтения файла.
Функция ПутьКФайлу() Экспорт

	Возврат _ПутьКФайлу;

КонецФункции

#КонецОбласти

