Перем _Вид; // Строка
Перем _Источник; // ЭлементРазобраннойКомандыCURL

#Область ОбработчикиСобытий

// Создаёт способ аутентификации прокси curl.
//
// Параметры:
//   Вид - Строка - Значение из модуля СпособыАутентификацииПроксиCURL.
//   Источник - ЭлементРазобраннойКомандыCURL - Исходная опция.
Процедура ПриСозданииОбъекта(Вид, Источник)
	_Вид = Вид;
	_Источник = Источник;
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает вид способа аутентификации прокси.
//
// Возвращаемое значение:
//   Строка - Значение из модуля СпособыАутентификацииПроксиCURL.
Функция Вид() Экспорт
	Возврат _Вид;
КонецФункции

// Возвращает исходную опцию.
//
// Возвращаемое значение:
//   ЭлементРазобраннойКомандыCURL - Исходная опция.
Функция Источник() Экспорт
	Возврат _Источник;
КонецФункции

#КонецОбласти
