Перем _Выражение; // ВыражениеЗначенияCURL
Перем _Источник; // ЭлементРазобраннойКомандыCURL

#Область ОбработчикиСобытий

// Создаёт токен OAuth2 curl.
//
// Параметры:
//   Выражение - ВыражениеЗначенияCURL - Выражение токена.
//   Источник - ЭлементРазобраннойКомандыCURL - Исходная опция.
Процедура ПриСозданииОбъекта(Выражение, Источник)
	_Выражение = Выражение;
	_Источник = Источник;
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает выражение токена.
//
// Возвращаемое значение:
//   ВыражениеЗначенияCURL - Выражение токена.
Функция Выражение() Экспорт
	Возврат _Выражение;
КонецФункции

// Возвращает исходную опцию.
//
// Возвращаемое значение:
//   ЭлементРазобраннойКомандыCURL - Исходная опция.
Функция Источник() Экспорт
	Возврат _Источник;
КонецФункции

#КонецОбласти
