Перем _Выражение; // ВыражениеЗначенияCURL
Перем _Значение; // Число, Неопределено
Перем _Формат; // Строка
Перем _ТребуетВычисления; // Булево
Перем _Источник; // ЭлементРазобраннойКомандыCURL

#Область ОбработчикиСобытий

// Создаёт числовое значение команды curl.
//
// Параметры:
//   Выражение - ВыражениеЗначенияCURL - Выражение.
//   Значение - Число, Неопределено - Значение.
//   Формат - Строка - Формат.
//   ТребуетВычисления - Булево - ТребуетВычисления.
//   Источник - ЭлементРазобраннойКомандыCURL - Источник.
Процедура ПриСозданииОбъекта(
	Выражение,
	Значение,
	Формат,
	ТребуетВычисления,
	Источник
)

	_Выражение = Выражение;
	_Значение = Значение;
	_Формат = Формат;
	_ТребуетВычисления = ТребуетВычисления;
	_Источник = Источник;
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает исходное выражение.
//
// Возвращаемое значение:
//   ВыражениеЗначенияCURL - Выражение.
Функция Выражение() Экспорт

	Возврат _Выражение;

КонецФункции

// Возвращает целое значение или число миллисекунд.
//
// Возвращаемое значение:
//   Число, Неопределено - Значение.
Функция Значение() Экспорт

	Возврат _Значение;

КонецФункции

// Возвращает формат исходного значения.
//
// Возвращаемое значение:
//   Строка - Формат.
Функция ФорматЗначения() Экспорт

	Возврат _Формат;

КонецФункции

// Возвращает признак необходимости вычисления выражения.
//
// Возвращаемое значение:
//   Булево - ТребуетВычисления.
Функция ТребуетВычисления() Экспорт

	Возврат _ТребуетВычисления;

КонецФункции

// Возвращает исходный элемент команды.
//
// Возвращаемое значение:
//   ЭлементРазобраннойКомандыCURL - Источник.
Функция Источник() Экспорт

	Возврат _Источник;

КонецФункции

#КонецОбласти
