#Использовать asserts
#Использовать ".."

Перем юТест;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт

	юТест = Тестирование;
	
	СписокТестов = Новый Массив;
	
	СписокТестов.Добавить("ТестДолжен_ПроверитьЗаголовки");
	СписокТестов.Добавить("ТестДолжен_ПроверитьПередачуМетода");
	СписокТестов.Добавить("ТестДолжен_ПроверитьПередачуПользователя");

	Возврат СписокТестов;
	
КонецФункции

Процедура ТестДолжен_ПроверитьЗаголовки() Экспорт

	КонсольнаяКоманда = "curl 'https://example.com' \
	|  -H 'accept: text/html' \
	|  -H 'accept-language: ru,en-US;q=0.9,en;q=0.8' \
	|  -H 'user-agent: curl'";

	ПрограммныйКод = "Заголовки = Новый Соответствие();
	|Заголовки.Вставить(""accept"", ""text/html"");
	|Заголовки.Вставить(""accept-language"", ""ru,en-US;q=0.9,en;q=0.8"");
	|Заголовки.Вставить(""user-agent"", ""curl"");
	|
	|ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
	|Соединение = Новый HTTPСоединение(""example.com"",
	|	443,
	|	,
	|	,
	|	,
	|	,
	|	ЗащищенноеСоединение);
	|
	|HTTPЗапрос = Новый HTTPЗапрос(""/"", Заголовки);
	|HTTPОтвет = Соединение.ВызватьHTTPМетод(""GET"", HTTPЗапрос);";

	КонвертерКомандыCURL = Новый КонвертерКомандыCURL();
	Результат = КонвертерКомандыCURL.Конвертировать(КонсольнаяКоманда, Новый ГенераторПрограммногоКода1С());

	Ожидаем.Что(Результат).Равно(ПрограммныйКод);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьПередачуМетода() Экспорт

	КонсольнаяКоманда = "curl 'https://example.com' -X 'POST'";

	ПрограммныйКод = "ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
	|Соединение = Новый HTTPСоединение(""example.com"",
	|	443,
	|	,
	|	,
	|	,
	|	,
	|	ЗащищенноеСоединение);
	|
	|HTTPЗапрос = Новый HTTPЗапрос(""/"");
	|HTTPОтвет = Соединение.ВызватьHTTPМетод(""POST"", HTTPЗапрос);";

	КонвертерКомандыCURL = Новый КонвертерКомандыCURL();
	Результат = КонвертерКомандыCURL.Конвертировать(КонсольнаяКоманда, Новый ГенераторПрограммногоКода1С());

	Ожидаем.Что(Результат).Равно(ПрограммныйКод);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьПередачуПользователя() Экспорт

	КонсольнаяКоманда = "curl 'https://example.com' -u user:secret";

	ПрограммныйКод = "ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
	|Соединение = Новый HTTPСоединение(""example.com"",
	|	443,
	|	""user"",
	|	""secret"",
	|	,
	|	,
	|	ЗащищенноеСоединение);
	|
	|HTTPЗапрос = Новый HTTPЗапрос(""/"");
	|HTTPОтвет = Соединение.ВызватьHTTPМетод(""GET"", HTTPЗапрос);";

	КонвертерКомандыCURL = Новый КонвертерКомандыCURL();
	Результат = КонвертерКомандыCURL.Конвертировать(КонсольнаяКоманда, Новый ГенераторПрограммногоКода1С());

	Ожидаем.Что(Результат).Равно(ПрограммныйКод);
	
КонецПроцедуры