// BSLLS:LatinAndCyrillicSymbolInWord-off

#Использовать asserts
#Использовать "../src/core"

Перем КонвертерКомандыCURL; // КонвертерКомандыCURL

&Инициализация
Процедура ПередЗапускомТестов() Экспорт

	КонвертерКомандыCURL = Новый КонвертерКомандыCURL();
	
КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьОшибкуКомандаДолжнаНачинатьсяСCurl() Экспорт

	КонсольнаяКоманда = "myapp -H 'accept: text/html'";

	Ошибки = Неопределено;

	Результат = КонвертерКомандыCURL.Конвертировать(КонсольнаяКоманда, , Ошибки);

	Ожидаем.Что(Результат).Не_().Заполнено();
	Ожидаем.Что(Ошибки).Заполнено();
	Ожидаем.Что(Ошибки[0].Текст).Равно("Команда должна начинаться с ""curl"", но вместо этого начинается с myapp");
	Ожидаем.Что(Ошибки[0].Критичная).ЭтоИстина();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПредупредитьОНеподдерживаемыхФайлахЗаголовковИСохранитьInlineЗаголовок() Экспорт

	// Подготовка
	КонсольнаяКоманда = "curl http://example.com/ -H @headers1.txt -H ""X-Inline: ok"" -H @headers2.txt";
	ПрограммныйКод = "Заголовки = Новый Соответствие();
	|Заголовки.Вставить(""X-Inline"", ""ok"");
	|
	|Соединение = Новый HTTPСоединение(""example.com"", 80);
	|HTTPЗапрос = Новый HTTPЗапрос(""/"", Заголовки);
	|
	|HTTPОтвет = Соединение.ВызватьHTTPМетод(""GET"", HTTPЗапрос);";
	Ошибки = Неопределено;

	// Действие
	Результат = КонвертерКомандыCURL.Конвертировать(КонсольнаяКоманда, , Ошибки);

	// Проверка
	Ожидаем.Что(Результат).Равно(ПрограммныйКод);
	Ожидаем.Что(Ошибки).ИмеетДлину(2);
	Ожидаем.Что(Ошибки[0].Текст).Равно("Чтение заголовков из файла для опции -H, --header не поддерживается: headers1.txt");
	Ожидаем.Что(Ошибки[0].Критичная).ЭтоЛожь();
	Ожидаем.Что(Ошибки[1].Текст).Равно("Чтение заголовков из файла для опции -H, --header не поддерживается: headers2.txt");
	Ожидаем.Что(Ошибки[1].Критичная).ЭтоЛожь();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПредупредитьОНеподдерживаемомФайлеЗаголовковТекстовойMultipartЧасти() Экспорт

	// Подготовка
	КонсольнаяКоманда = "curl http://example.com/ -F ""name=daniel;headers=@headers1.txt;headers=\""X-Inline: ok\"";headers=@headers2.txt""";
	ПрограммныйКод = "РазделительMultipart = СтрЗаменить(Новый УникальныйИдентификатор, ""-"", """");
	|
	|Заголовки = Новый Соответствие();
	|Заголовки.Вставить(""Content-Type"", ""multipart/form-data; boundary="" + РазделительMultipart);
	|
	|Соединение = Новый HTTPСоединение(""example.com"", 80);
	|HTTPЗапрос = Новый HTTPЗапрос(""/"", Заголовки);
	|Поток = HTTPЗапрос.ПолучитьТелоКакПоток();
	|
	|РазделительСтрок = Символы.ВК + Символы.ПС;
	|ЗаписьДанных = Новый ЗаписьДанных(Поток, , , """", """");
	|// Начало name
	|ЗаписьДанных.ЗаписатьСтроку(""--"" + РазделительMultipart + РазделительСтрок);
	|ЗаписьДанных.ЗаписатьСтроку(""Content-Disposition: form-data; name=""""name"""""" + РазделительСтрок);
	|ЗаписьДанных.ЗаписатьСтроку(""X-Inline: ok"" + РазделительСтрок);
	|ЗаписьДанных.ЗаписатьСтроку(РазделительСтрок);
	|ЗаписьДанных.ЗаписатьСтроку(""daniel"" + РазделительСтрок);
	|// Конец name
	|ЗаписьДанных.ЗаписатьСтроку(""--"" + РазделительMultipart + ""--"" + РазделительСтрок);
	|ЗаписьДанных.Закрыть();
	|
	|HTTPОтвет = Соединение.ВызватьHTTPМетод(""POST"", HTTPЗапрос);";
	Ошибки = Неопределено;

	// Действие
	Результат = КонвертерКомандыCURL.Конвертировать(КонсольнаяКоманда, , Ошибки);

	// Проверка
	Ожидаем.Что(Результат).Равно(ПрограммныйКод);
	Ожидаем.Что(Ошибки).ИмеетДлину(2);
	Ожидаем.Что(Ошибки[0].Текст).Равно(
		"Чтение заголовков multipart-части из файла для опции -F, --form не поддерживается: headers1.txt"
	);
	Ожидаем.Что(Ошибки[0].Критичная).ЭтоЛожь();
	Ожидаем.Что(Ошибки[1].Текст).Равно(
		"Чтение заголовков multipart-части из файла для опции -F, --form не поддерживается: headers2.txt"
	);
	Ожидаем.Что(Ошибки[1].Критичная).ЭтоЛожь();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПредупредитьОНеподдерживаемомФайлеЗаголовковФайловойMultipartЧасти() Экспорт

	// Подготовка
	КонсольнаяКоманда = "curl http://example.com/ -F ""brief=@file.pdf;headers=@headers1.txt;headers=\""X-Inline: ok\""""";
	ПрограммныйКод = "Файлы = Новый Массив();
	|Файл = Новый Структура();
	|Файл.Вставить(""Имя"", ""brief"");
	|Файл.Вставить(""ИмяФайла"", ""file.pdf"");
	|Файл.Вставить(""Данные"", Новый ДвоичныеДанные(""file.pdf""));
	|Файл.Вставить(""Заголовки"", Новый Соответствие());
	|Файл.Заголовки.Вставить(""X-Inline"", ""ok"");
	|Файлы.Добавить(Файл);
	|
	|ДополнительныеПараметры = Новый Структура();
	|ДополнительныеПараметры.Вставить(""Файлы"", Файлы);
	|
	|Результат = КоннекторHTTP.Post(""http://example.com"", , ДополнительныеПараметры);";
	Ошибки = Неопределено;
	Генератор = Новый ГенераторПрограммногоКодаКоннекторHTTP();

	// Действие
	Результат = КонвертерКомандыCURL.Конвертировать(КонсольнаяКоманда, Генератор, Ошибки);

	// Проверка
	Ожидаем.Что(Результат).Равно(ПрограммныйКод);
	Ожидаем.Что(Ошибки).ИмеетДлину(1);
	Ожидаем.Что(Ошибки[0].Текст).Равно(
		"Чтение заголовков multipart-части из файла для опции -F, --form не поддерживается: headers1.txt"
	);
	Ожидаем.Что(Ошибки[0].Критичная).ЭтоЛожь();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьОшибкуПереданаПустаяКоманда() Экспорт

	КонсольнаяКоманда = "";

	Ошибки = Неопределено;

	Результат = КонвертерКомандыCURL.Конвертировать(КонсольнаяКоманда, , Ошибки);

	Ожидаем.Что(Результат).Не_().Заполнено();
	Ожидаем.Что(Ошибки).Заполнено();
	Ожидаем.Что(Ошибки[0].Текст).Равно("Передана пустая команда");
	Ожидаем.Что(Ошибки[0].Критичная).ЭтоИстина();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьОшибкуОпцияНеизвестна() Экспорт

	КонсольнаяКоманда = "curl http://example.com/ --unknown-option";

	Ошибки = Неопределено;

	Результат = КонвертерКомандыCURL.Конвертировать(КонсольнаяКоманда, , Ошибки);

	Ожидаем.Что(Результат).Не_().Заполнено();
	Ожидаем.Что(Ошибки).Заполнено();
	Ожидаем.Что(Ошибки[0].Текст).Равно("Опция --unknown-option неизвестна");
	Ожидаем.Что(Ошибки[0].Критичная).ЭтоИстина();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьОшибкуОпцияНеПоддерживается() Экспорт

	КонсольнаяКоманда = "curl http://example.com/ --hsts cache.txt";
	
	ПрограммныйКод = "Соединение = Новый HTTPСоединение(""example.com"", 80);
	|HTTPЗапрос = Новый HTTPЗапрос(""/"");
	|
	|HTTPОтвет = Соединение.ВызватьHTTPМетод(""GET"", HTTPЗапрос);";

	Ошибки = Неопределено;

	Результат = КонвертерКомандыCURL.Конвертировать(КонсольнаяКоманда, , Ошибки);

	Ожидаем.Что(Результат).Равно(ПрограммныйКод);
	Ожидаем.Что(Ошибки).Заполнено();
	Ожидаем.Что(Ошибки[0].Текст).Равно("Опция --hsts не поддерживается");
	Ожидаем.Что(Ошибки[0].Критичная).ЭтоЛожь();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьОшибкуНеУказанURL() Экспорт

	КонсольнаяКоманда = "curl";
	
	Ошибки = Неопределено;

	Результат = КонвертерКомандыCURL.Конвертировать(КонсольнаяКоманда, , Ошибки);

	Ожидаем.Что(Результат).Не_().Заполнено();
	Ожидаем.Что(Ошибки).Заполнено();
	Ожидаем.Что(Ошибки[0].Текст).Равно("Не указан URL");
	Ожидаем.Что(Ошибки[0].Критичная).ЭтоИстина();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьОшибкуНеУказанОдинИзURL() Экспорт

	КонсольнаяКоманда = "curl example1.com '' example2.com";
	
	Ошибки = Неопределено;

	Результат = КонвертерКомандыCURL.Конвертировать(КонсольнаяКоманда, , Ошибки);

	Ожидаем.Что(Результат).Не_().Заполнено();
	Ожидаем.Что(Ошибки).Заполнено();
	Ожидаем.Что(Ошибки[0].Текст).Равно("Не указан URL #2");
	Ожидаем.Что(Ошибки[0].Критичная).ЭтоИстина();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьОшибкуНеУдалосьПолучитьНомерПортаИзURL() Экспорт

	КонсольнаяКоманда = "curl http://example.com:port";

	Ошибки = Неопределено;

	Результат = КонвертерКомандыCURL.Конвертировать(КонсольнаяКоманда, , Ошибки);

	Ожидаем.Что(Результат).Не_().Заполнено();
	Ожидаем.Что(Ошибки).Заполнено();
	Ожидаем.Что(Ошибки[0].Текст).Равно("Не удалось получить номер порта из URL 'http://example.com:port'");
	Ожидаем.Что(Ошибки[0].Критичная).ЭтоИстина();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьОшибкуНеправильноеИспользованиеФигурныхСкобокПриПередачеФайла() Экспорт

	ТестовыеЗначения = Новый Массив();
	ТестовыеЗначения.Добавить("{path");
	ТестовыеЗначения.Добавить("path}");
	ТестовыеЗначения.Добавить("}path}");
	ТестовыеЗначения.Добавить("{path{");
	ТестовыеЗначения.Добавить("}path{");

	Для Каждого ТестовоеЗначение Из ТестовыеЗначения Цикл
		КонсольнаяКоманда = "curl --upload-file '" + ТестовоеЗначение + "' http://example.com";

		Ошибки = Неопределено;

		Результат = КонвертерКомандыCURL.Конвертировать(КонсольнаяКоманда, , Ошибки);

		Ожидаем.Что(Результат).Не_().Заполнено();
		Ожидаем.Что(Ошибки).Заполнено();
		Ожидаем.Что(Ошибки[0].Текст).Равно("Неправильное использование фигурных скобок в значении '" + ТестовоеЗначение + "' опции -T, --upload-file");
		Ожидаем.Что(Ошибки[0].Критичная).ЭтоИстина();
	КонецЦикла;
	
КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьОшибкуЗапрещеноОдновременноеИспользованиеНесколькихHTTPМетодов() Экспорт
	
	// Ошибочные команды
	ОшибочныеКоманды = Новый Массив();
	ОшибочныеКоманды.Добавить("-T file --get -d 'key=val'");
	ОшибочныеКоманды.Добавить("-T file -d 'key=val'");
	ОшибочныеКоманды.Добавить("-T file --json '{""key"": ""val""}'");
	ОшибочныеКоманды.Добавить("-T file --head");
	ОшибочныеКоманды.Добавить("-d 'key=val' --head");

	Для Каждого Команда Из ОшибочныеКоманды Цикл
		КонсольнаяКоманда = "curl http://example.com " + Команда;

		Ошибки = Неопределено;

		Результат = КонвертерКомандыCURL.Конвертировать(КонсольнаяКоманда, , Ошибки);

		Ожидаем.Что(Результат).Не_().Заполнено();
		Ожидаем.Что(Ошибки, "Команда не валидна: " + КонсольнаяКоманда).Заполнено();
		Ожидаем.Что(Ошибки[0].Текст).Содержит("Запрещено одновременное использование нескольких HTTP методов");
		Ожидаем.Что(Ошибки[0].Критичная).ЭтоИстина();
	КонецЦикла;
	
	// Валидные команды
	ВалидныеКоманды = Новый Массив();
	ВалидныеКоманды.Добавить("-T file --get");
	ВалидныеКоманды.Добавить("--get --head");
	ВалидныеКоманды.Добавить("-d 'key=val' --get");
	ВалидныеКоманды.Добавить("-d 'key=val' --get --head");

	Для Каждого Команда Из ВалидныеКоманды Цикл
		КонсольнаяКоманда = "curl http://example.com " + Команда;

		Ошибки = Неопределено;

		Результат = КонвертерКомандыCURL.Конвертировать(КонсольнаяКоманда, , Ошибки);

		Ожидаем.Что(Ошибки, "Команда валидна: " + КонсольнаяКоманда).Не_().Заполнено();
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьОшибкуПротоколНеПоддерживается() Экспорт

	КонсольнаяКоманда = "curl smtp://example.com";

	Ошибки = Неопределено;

	Результат = КонвертерКомандыCURL.Конвертировать(КонсольнаяКоманда, , Ошибки);

	Ожидаем.Что(Результат).Не_().Заполнено();
	Ожидаем.Что(Ошибки).Заполнено();
	Ожидаем.Что(Ошибки[0].Текст).Равно("Протокол ""smtp"" не поддерживается");
	Ожидаем.Что(Ошибки[0].Критичная).ЭтоИстина();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьОшибкуОдновременнаяПередачаОпцийЗапрещенаДляОтправляемыхДанных() Экспорт
	
	// Ошибочные команды
	ОшибочныеКоманды = Новый Массив();
	ОшибочныеКоманды.Добавить("-d data -F data");
	ОшибочныеКоманды.Добавить("--data data -F data");
	ОшибочныеКоманды.Добавить("--data-raw data -F data");
	ОшибочныеКоманды.Добавить("--data-binary @file -F data");
	ОшибочныеКоманды.Добавить("--data-urlencode data -F data");
	ОшибочныеКоманды.Добавить("--data-ascii data -F data");
	ОшибочныеКоманды.Добавить("--head -F data");
	ОшибочныеКоманды.Добавить("-T file -F data");
	ОшибочныеКоманды.Добавить("--upload-file file -F data");

	Для Каждого Команда Из ОшибочныеКоманды Цикл
		КонсольнаяКоманда = "curl http://example.com " + Команда;

		Ошибки = Неопределено;

		Результат = КонвертерКомандыCURL.Конвертировать(КонсольнаяКоманда, , Ошибки);

		Ожидаем.Что(Результат).Не_().Заполнено();
		Ожидаем.Что(Ошибки, "Команда не валидна: " + КонсольнаяКоманда).Заполнено();
		Ожидаем.Что(Ошибки[0].Текст).Содержит("Одновременная передача опций");
		Ожидаем.Что(Ошибки[0].Критичная).ЭтоИстина();
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьОшибкуЗапрещеноИспользоватьНесколькоТиповАутентификации() Экспорт

	ОшибочныеКоманды = Новый Массив();
	ОшибочныеКоманды.Добавить("--basic --digest");
	ОшибочныеКоманды.Добавить("--ntlm --negotiate");
	ОшибочныеКоманды.Добавить("--aws-sigv4 'aws:amz:us-east-2:es' --oauth2-bearer token");

	Для Каждого Команда Из ОшибочныеКоманды Цикл
		КонсольнаяКоманда = "curl http://example.com " + Команда;

		Ошибки = Неопределено;

		Результат = КонвертерКомандыCURL.Конвертировать(КонсольнаяКоманда, , Ошибки);

		Ожидаем.Что(Результат).Не_().Заполнено();
		Ожидаем.Что(Ошибки, "Команда не валидна: " + КонсольнаяКоманда).Заполнено();
		Ожидаем.Что(Ошибки[0].Текст).Содержит("Запрещено использовать несколько типов аутентификации");
		Ожидаем.Что(Ошибки[0].Критичная).ЭтоИстина();
	КонецЦикла;

КонецПроцедуры
