#Использовать asserts
#Использовать ".."

Перем юТест;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт

	юТест = Тестирование;
	
	СписокТестов = Новый Массив;
	
	СписокТестов.Добавить("ТестДолжен_ПроверитьОбщийСлучай");
	СписокТестов.Добавить("ТестДолжен_ПроверитьМногострочнуюКоманду");
	СписокТестов.Добавить("ТестДолжен_ПроверитьПарсингКавычекСПоддержкойИнтерполяции");
	СписокТестов.Добавить("ТестДолжен_ПроверитьПарсингКавычекБезПоддержкиИнтерполяции");
	СписокТестов.Добавить("ТестДолжен_ПроверитьПробелВЗначенииПараметра");
	СписокТестов.Добавить("ТестДолжен_ПроверитьОператорыСвязыванияКоманд");
	СписокТестов.Добавить("ТестДолжен_ПроверитьПоддержкуПробельныхСимволов");
	СписокТестов.Добавить("ТестДолжен_ПроверитьПоддержкуПустогоЗначения");

	Возврат СписокТестов;
	
КонецФункции

Процедура ТестДолжен_ПроверитьОбщийСлучай() Экспорт

	КоманднаяСтрока = "myapp command -a --long-option 2> error.txt";

	Эталон = Новый Массив;
	Эталон.Добавить("myapp");
	Эталон.Добавить("command");
	Эталон.Добавить("-a");
	Эталон.Добавить("--long-option");
	Эталон.Добавить("2>");
	Эталон.Добавить("error.txt");
	
	Парсер = Новый ПарсерКонсольнойКоманды();
	Результат = Парсер.Распарсить(КоманднаяСтрока);

	Ожидаем.Что(Результат).ИмеетДлину(1);
	Ожидаем.Что(Результат[0]).ИмеетДлину(Эталон.Количество());

	Для Инд = 0 По Результат[0].ВГраница() Цикл
		Ожидаем.Что(Результат[0][Инд]).Равно(Эталон[Инд]);
	КонецЦикла;
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьМногострочнуюКоманду() Экспорт

	КоманднаяСтрока = "myapp command -a \
	|--long-option ""value"" \
	| 2> error.txt";

	Эталон = Новый Массив;
	Эталон.Добавить("myapp");
	Эталон.Добавить("command");
	Эталон.Добавить("-a");
	Эталон.Добавить("--long-option");
	Эталон.Добавить("value");
	Эталон.Добавить("2>");
	Эталон.Добавить("error.txt");
	
	Парсер = Новый ПарсерКонсольнойКоманды();
	Результат = Парсер.Распарсить(КоманднаяСтрока);

	Ожидаем.Что(Результат).ИмеетДлину(1);
	Ожидаем.Что(Результат[0]).ИмеетДлину(Эталон.Количество());

	Для Инд = 0 По Результат[0].ВГраница() Цикл
		Ожидаем.Что(Результат[0][Инд]).Равно(Эталон[Инд]);
	КонецЦикла;
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьПарсингКавычекСПоддержкойИнтерполяции() Экспорт

	КоманднаяСтрока = "myapp -a ""Te\""xt"" -b \"" -c ""\""\""\"""" -d ""'""";

	Эталон = Новый Массив;
	Эталон.Добавить("myapp");
	Эталон.Добавить("-a");
	Эталон.Добавить("Te""xt");
	Эталон.Добавить("-b");
	Эталон.Добавить("""");
	Эталон.Добавить("-c");
	Эталон.Добавить("""""""");
	Эталон.Добавить("-d");
	Эталон.Добавить("'");
	
	Парсер = Новый ПарсерКонсольнойКоманды();
	Результат = Парсер.Распарсить(КоманднаяСтрока);

	Ожидаем.Что(Результат).ИмеетДлину(1);
	Ожидаем.Что(Результат[0]).ИмеетДлину(Эталон.Количество());

	Для Инд = 0 По Результат[0].ВГраница() Цикл
		Ожидаем.Что(Результат[0][Инд]).Равно(Эталон[Инд]);
	КонецЦикла;
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьПарсингКавычекБезПоддержкиИнтерполяции() Экспорт

	КоманднаяСтрока = "myapp -a 'Te\""xt' -b \' -c '""'";

	Эталон = Новый Массив;
	Эталон.Добавить("myapp");
	Эталон.Добавить("-a");	
	Эталон.Добавить("Te\""xt");
	Эталон.Добавить("-b");
	Эталон.Добавить("'");
	Эталон.Добавить("-c");
	Эталон.Добавить("""");
	
	Парсер = Новый ПарсерКонсольнойКоманды();
	Результат = Парсер.Распарсить(КоманднаяСтрока);

	Ожидаем.Что(Результат).ИмеетДлину(1);
	Ожидаем.Что(Результат[0]).ИмеетДлину(Эталон.Количество());

	Для Инд = 0 По Результат[0].ВГраница() Цикл
		Ожидаем.Что(Результат[0][Инд]).Равно(Эталон[Инд]);
	КонецЦикла;
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьПробелВЗначенииПараметра() Экспорт

	КоманднаяСтрока = "myapp -a ' '";

	Эталон = Новый Массив;
	Эталон.Добавить("myapp");
	Эталон.Добавить("-a");
	Эталон.Добавить(" ");
	
	Парсер = Новый ПарсерКонсольнойКоманды();
	Результат = Парсер.Распарсить(КоманднаяСтрока);

	Ожидаем.Что(Результат).ИмеетДлину(1);
	Ожидаем.Что(Результат[0]).ИмеетДлину(Эталон.Количество());

	Для Инд = 0 По Результат[0].ВГраница() Цикл
		Ожидаем.Что(Результат[0][Инд]).Равно(Эталон[Инд]);
	КонецЦикла;

КонецПроцедуры

Процедура ТестДолжен_ПроверитьОператорыСвязыванияКоманд() Экспорт

	КоманднаяСтрока = "myapp -a & myapp -b
	|myapp -c '&' &
	|command1 ; command2 ; 
	|command3 | command4";

	Эталон = Новый Массив;

	Команда = Новый Массив();
	Команда.Добавить("myapp");
	Команда.Добавить("-a");
	Эталон.Добавить(Команда);

	Команда = Новый Массив();
	Команда.Добавить("myapp");
	Команда.Добавить("-b");
	Эталон.Добавить(Команда);

	Команда = Новый Массив();
	Команда.Добавить("myapp");
	Команда.Добавить("-c");
	Команда.Добавить("&");
	Эталон.Добавить(Команда);

	Команда = Новый Массив();
	Команда.Добавить("command1");
	Эталон.Добавить(Команда);
	
	Команда = Новый Массив();
	Команда.Добавить("command2");
	Эталон.Добавить(Команда);
	
	Команда = Новый Массив();
	Команда.Добавить("command3");
	Эталон.Добавить(Команда);
	
	Команда = Новый Массив();
	Команда.Добавить("command4");
	Эталон.Добавить(Команда);

	Парсер = Новый ПарсерКонсольнойКоманды();
	Результат = Парсер.Распарсить(КоманднаяСтрока);

	Ожидаем.Что(Результат).ИмеетДлину(Эталон.Количество());

	Для Инд1 = 0 По Результат.ВГраница() Цикл
		Ожидаем.Что(Результат[Инд1]).ИмеетДлину(Эталон[Инд1].Количество());

		Для Инд2 = 0 По Результат[Инд1].ВГраница() Цикл
			Ожидаем.Что(Результат[Инд1][Инд2]).Равно(Эталон[Инд1][Инд2]);
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

Процедура ТестДолжен_ПроверитьПоддержкуПробельныхСимволов() Экспорт

	КоманднаяСтрока = "myapp -a \
	|" + Символы.Таб + "-b \
	|" + Символы.ВТаб + "-c \
	|" + Символы.ВК + "-d \
	|" + Символы.ПФ + "-e";
	
	Эталон = Новый Массив;
	Эталон.Добавить("myapp");
	Эталон.Добавить("-a");
	Эталон.Добавить("-b");
	Эталон.Добавить("-c");
	Эталон.Добавить("-d");
	Эталон.Добавить("-e");
	
	Парсер = Новый ПарсерКонсольнойКоманды();
	Результат = Парсер.Распарсить(КоманднаяСтрока);

	Ожидаем.Что(Результат).ИмеетДлину(1);
	Ожидаем.Что(Результат[0]).ИмеетДлину(Эталон.Количество());

	Для Инд = 0 По Результат[0].ВГраница() Цикл
		Ожидаем.Что(Результат[0][Инд]).Равно(Эталон[Инд]);
	КонецЦикла;

КонецПроцедуры

Процедура ТестДолжен_ПроверитьПоддержкуПустогоЗначения() Экспорт

	КоманднаяСтрока = "myapp -a '' -b ' '";
	
	Эталон = Новый Массив;
	Эталон.Добавить("myapp");
	Эталон.Добавить("-a");
	Эталон.Добавить("");
	Эталон.Добавить("-b");
	Эталон.Добавить(" ");
	
	Парсер = Новый ПарсерКонсольнойКоманды();
	Результат = Парсер.Распарсить(КоманднаяСтрока);

	Ожидаем.Что(Результат).ИмеетДлину(1);
	Ожидаем.Что(Результат[0]).ИмеетДлину(Эталон.Количество());

	Для Инд = 0 По Результат[0].ВГраница() Цикл
		Ожидаем.Что(Результат[0][Инд]).Равно(Эталон[Инд]);
	КонецЦикла;

КонецПроцедуры