// BSLLS:LatinAndCyrillicSymbolInWord-off

#Использовать asserts
#Использовать "../src/internal"

#Область Тесты

&Тест
Процедура ТестДолжен_СохранитьЗначимыеПробелыЗначения() Экспорт

	// Подготовка
	Парсер = Новый ПарсерЗначенияОпцииForm();

	// Действие
	Результат = Парсер.Распарсить("field=""  value  """);

	// Проверка
	Ожидаем.Что(Результат.Значения[0].Значение).Равно("  value  ");
	Ожидаем.Что(ТипЗнч(Результат.Значения[0].ФайлыЗаголовков)).Равно(Тип("Массив"));

КонецПроцедуры

&Тест
Процедура ТестДолжен_СохранитьСсылкуНаФайлЗаголовковОтдельно() Экспорт

	// Подготовка
	Парсер = Новый ПарсерЗначенияОпцииForm();

	// Действие
	Результат = Парсер.Распарсить("brief=@file.pdf;headers= @headers.txt ");

	// Проверка
	Ожидаем.Что(Результат.Значения[0].ФайлыЗаголовков).ИмеетДлину(1);
	Ожидаем.Что(Результат.Значения[0].ФайлыЗаголовков[0]).Равно("headers.txt");
	Ожидаем.Что(Результат.Значения[0].Параметры["headers"]).ИмеетДлину(0);

КонецПроцедуры

#КонецОбласти
