Перем _События; // Массив из ФиксированнаяСтруктура: Имя (Строка), Аргументы (ФиксированныйМассив)

#Область ОбработчикиСобытий

// Создаёт получатель семантических событий для тестов.
Процедура ПриСозданииОбъекта()

	_События = Новый Массив;

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает зафиксированные события в порядке вызовов.
//
// Возвращаемое значение:
//   ФиксированныйМассив из ФиксированнаяСтруктура - Имя и аргументы каждого вызова.
Функция События() Экспорт

	Возврат Новый ФиксированныйМассив(_События);

КонецФункции

// Регистрирует событие ДобавитьURL.
//
// Параметры:
//   Элемент - ЭлементРазобраннойКомандыCURL - Элемент события.
Процедура ДобавитьURL(Элемент) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Элемент);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"ДобавитьURL", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

// Регистрирует событие ДобавитьРезультат.
//
// Параметры:
//   Описание - ОписаниеРезультатаCURL - Описание события.
Процедура ДобавитьРезультат(Описание) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Описание);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"ДобавитьРезультат", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

// Регистрирует событие ДобавитьЗагрузку.
//
// Параметры:
//   Часть - ЧастьТелаЗапросаCURL - Часть события.
Процедура ДобавитьЗагрузку(Часть) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Часть);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"ДобавитьЗагрузку", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

// Регистрирует событие ДобавитьЧастьЗапроса.
//
// Параметры:
//   Часть - ЧастьСтрокиЗапросаCURL - Часть события.
Процедура ДобавитьЧастьЗапроса(Часть) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Часть);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"ДобавитьЧастьЗапроса", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

// Регистрирует событие УстановитьЯвныйМетод.
//
// Параметры:
//   Выражение - ВыражениеЗначенияCURL - Выражение события.
Процедура УстановитьЯвныйМетод(Выражение) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Выражение);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"УстановитьЯвныйМетод", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

// Регистрирует событие УстановитьУчетныеДанные.
//
// Параметры:
//   Значение - УчетныеДанныеCURL - Значение события.
Процедура УстановитьУчетныеДанные(Значение) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Значение);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"УстановитьУчетныеДанные", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

// Регистрирует событие УстановитьOAuth2.
//
// Параметры:
//   Токен - ТокенOAuth2CURL - Токен события.
Процедура УстановитьOAuth2(Токен) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Токен);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"УстановитьOAuth2", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

// Регистрирует событие УстановитьПодписьAWSV4.
//
// Параметры:
//   Параметры - ПараметрыПодписиAWSV4CURL - Параметры события.
Процедура УстановитьПодписьAWSV4(Параметры) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Параметры);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"УстановитьПодписьAWSV4", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

// Регистрирует событие УстановитьСертификатКлиента.
//
// Параметры:
//   Сертификат - СертификатКлиентаCURL - Сертификат события.
Процедура УстановитьСертификатКлиента(Сертификат) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Сертификат);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"УстановитьСертификатКлиента", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

// Регистрирует событие УстановитьПрокси.
//
// Параметры:
//   Прокси - ПроксиCURL - Прокси события.
Процедура УстановитьПрокси(Прокси) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Прокси);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"УстановитьПрокси", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

// Регистрирует событие УстановитьУчетныеДанныеПрокси.
//
// Параметры:
//   Значение - УчетныеДанныеCURL - Значение события.
Процедура УстановитьУчетныеДанныеПрокси(Значение) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Значение);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"УстановитьУчетныеДанныеПрокси", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

// Регистрирует событие УстановитьТаймаут.
//
// Параметры:
//   Значение - ЧисловоеЗначениеCURL - Значение события.
Процедура УстановитьТаймаут(Значение) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Значение);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"УстановитьТаймаут", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

// Регистрирует событие УстановитьТаймаутСоединения.
//
// Параметры:
//   Значение - ЧисловоеЗначениеCURL - Значение события.
Процедура УстановитьТаймаутСоединения(Значение) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Значение);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"УстановитьТаймаутСоединения", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

// Регистрирует событие УстановитьКоличествоПовторов.
//
// Параметры:
//   Значение - ЧисловоеЗначениеCURL - Значение события.
Процедура УстановитьКоличествоПовторов(Значение) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Значение);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"УстановитьКоличествоПовторов", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

// Регистрирует событие УстановитьМаксимальноеВремяПовторов.
//
// Параметры:
//   Значение - ЧисловоеЗначениеCURL - Значение события.
Процедура УстановитьМаксимальноеВремяПовторов(Значение) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Значение);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"УстановитьМаксимальноеВремяПовторов", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

// Регистрирует событие УстановитьПереносДанныхВURL.
//
// Параметры:
//   Значение - Булево - Значение события.
//   Источник - ЭлементРазобраннойКомандыCURL - Источник события.
Процедура УстановитьПереносДанныхВURL(Значение, Источник) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Значение);
	Аргументы.Добавить(Источник);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"УстановитьПереносДанныхВURL", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

// Регистрирует событие УстановитьТолькоИмена.
//
// Параметры:
//   Значение - Булево - Значение события.
//   Источник - ЭлементРазобраннойКомандыCURL - Источник события.
Процедура УстановитьТолькоИмена(Значение, Источник) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Значение);
	Аргументы.Добавить(Источник);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"УстановитьТолькоИмена", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

// Регистрирует событие УстановитьСозданиеКаталогов.
//
// Параметры:
//   Значение - Булево - Значение события.
//   Источник - ЭлементРазобраннойКомандыCURL - Источник события.
Процедура УстановитьСозданиеКаталогов(Значение, Источник) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Значение);
	Аргументы.Добавить(Источник);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"УстановитьСозданиеКаталогов", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

// Регистрирует событие УстановитьКаталогРезультата.
//
// Параметры:
//   Выражение - ВыражениеЗначенияCURL - Выражение события.
//   Источник - ЭлементРазобраннойКомандыCURL - Источник события.
Процедура УстановитьКаталогРезультата(Выражение, Источник) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Выражение);
	Аргументы.Добавить(Источник);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"УстановитьКаталогРезультата", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

// Регистрирует событие УстановитьСертификатыУдостоверяющегоЦентра.
//
// Параметры:
//   Выражение - ВыражениеЗначенияCURL - Выражение события.
//   Источник - ЭлементРазобраннойКомандыCURL - Источник события.
Процедура УстановитьСертификатыУдостоверяющегоЦентра(Выражение, Источник) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Выражение);
	Аргументы.Добавить(Источник);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"УстановитьСертификатыУдостоверяющегоЦентра", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

// Регистрирует событие УстановитьСистемноеХранилище.
//
// Параметры:
//   Значение - Булево - Значение события.
//   Источник - ЭлементРазобраннойКомандыCURL - Источник события.
Процедура УстановитьСистемноеХранилище(Значение, Источник) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Значение);
	Аргументы.Добавить(Источник);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"УстановитьСистемноеХранилище", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

// Регистрирует событие УстановитьПеренаправления.
//
// Параметры:
//   Следовать - Булево - Следовать события.
//   Источник - ЭлементРазобраннойКомандыCURL - Источник события.
Процедура УстановитьПеренаправления(Следовать, Источник) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Следовать);
	Аргументы.Добавить(Источник);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"УстановитьПеренаправления", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

// Регистрирует событие УстановитьИмяИзURLПоУмолчанию.
//
// Параметры:
//   Значение - Булево - Значение события.
//   Источник - ЭлементРазобраннойКомандыCURL - Источник события.
Процедура УстановитьИмяИзURLПоУмолчанию(Значение, Источник) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Значение);
	Аргументы.Добавить(Источник);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"УстановитьИмяИзURLПоУмолчанию", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

// Регистрирует событие ОтключитьПозиционноеИмяИзURL.
//
// Параметры:
//   Источник - ЭлементРазобраннойКомандыCURL - Источник события.
Процедура ОтключитьПозиционноеИмяИзURL(Источник) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Источник);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"ОтключитьПозиционноеИмяИзURL", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

// Регистрирует событие УстановитьРежимFTP.
//
// Параметры:
//   Режим - Строка - Режим события.
//   Адрес - ВыражениеЗначенияCURL, Неопределено - Адрес события.
//   Источник - ЭлементРазобраннойКомандыCURL - Источник события.
Процедура УстановитьРежимFTP(Режим, Адрес, Источник) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Режим);
	Аргументы.Добавить(Адрес);
	Аргументы.Добавить(Источник);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"УстановитьРежимFTP", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

// Регистрирует событие УстановитьНеПолучатьТело.
//
// Параметры:
//   Значение - Булево - Значение события.
//   Источник - ЭлементРазобраннойКомандыCURL - Источник события.
Процедура УстановитьНеПолучатьТело(Значение, Источник) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Значение);
	Аргументы.Добавить(Источник);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"УстановитьНеПолучатьТело", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

// Регистрирует событие ИзменитьСпособАутентификации.
//
// Параметры:
//   Способ - СпособАутентификацииCURL - Способ события.
//   Добавить - Булево - Добавить события.
Процедура ИзменитьСпособАутентификации(Способ, Добавить) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Способ);
	Аргументы.Добавить(Добавить);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"ИзменитьСпособАутентификации", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

// Регистрирует событие ИзменитьСпособАутентификацииПрокси.
//
// Параметры:
//   Способ - СпособАутентификацииПроксиCURL - Способ события.
//   Добавить - Булево - Добавить события.
Процедура ИзменитьСпособАутентификацииПрокси(Способ, Добавить) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Способ);
	Аргументы.Добавить(Добавить);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"ИзменитьСпособАутентификацииПрокси", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

// Регистрирует событие ДобавитьОшибки.
//
// Параметры:
//   Ошибки - Массив, ФиксированныйМассив из ИнформацияОбОшибке - Ошибки события.
Процедура ДобавитьОшибки(Ошибки) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Ошибки);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"ДобавитьОшибки", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

// Регистрирует событие ДобавитьЗаголовок.
//
// Параметры:
//   Операция - ОперацияНадЗаголовкомCURL - Операция события.
Процедура ДобавитьЗаголовок(Операция) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Операция);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"ДобавитьЗаголовок", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

// Регистрирует событие ДобавитьЧастьТела.
//
// Параметры:
//   Часть - ЧастьТелаЗапросаCURL - Часть события.
Процедура ДобавитьЧастьТела(Часть) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить(Часть);
	_События.Добавить(Новый ФиксированнаяСтруктура("Имя, Аргументы",
		"ДобавитьЧастьТела", Новый ФиксированныйМассив(Аргументы)));

КонецПроцедуры

#КонецОбласти

