#Область ПрограммныйИнтерфейс

// Возвращает именованное значение Текст.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция Текст() Экспорт

	Возврат "text";

КонецФункции

// Возвращает именованное значение Файл.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция Файл() Экспорт

	Возврат "file";

КонецФункции

// Возвращает именованное значение СтандартныйВвод.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция СтандартныйВвод() Экспорт

	Возврат "stdin";

КонецФункции

// Возвращает именованное значение ОпределитьПослеВычисления.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция ОпределитьПослеВычисления() Экспорт

	Возврат "deferred";

КонецФункции

#КонецОбласти
