#Область ПрограммныйИнтерфейс

// Возвращает именованное значение Данные.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция Данные() Экспорт

	Возврат "data";

КонецФункции

// Возвращает именованное значение ПолеMultipart.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция ПолеMultipart() Экспорт

	Возврат "multipart_field";

КонецФункции

// Возвращает именованное значение ЗагрузкаФайла.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция ЗагрузкаФайла() Экспорт

	Возврат "upload_file";

КонецФункции

// Возвращает именованное значение ОпределитьПослеВычисления.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция ОпределитьПослеВычисления() Экспорт

	Возврат "deferred";

КонецФункции

#КонецОбласти
