#Область ПрограммныйИнтерфейс

// Возвращает именованное значение Отсутствует.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция Отсутствует() Экспорт

	Возврат "none";

КонецФункции

// Возвращает именованное значение Данные.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция Данные() Экспорт

	Возврат "data";

КонецФункции

// Возвращает именованное значение Multipart.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция Multipart() Экспорт

	Возврат "multipart";

КонецФункции

// Возвращает именованное значение ЗагрузкаФайла.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция ЗагрузкаФайла() Экспорт

	Возврат "upload_file";

КонецФункции

#КонецОбласти
