#Область ПрограммныйИнтерфейс

// Возвращает именованное значение URL.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция URL() Экспорт

	Возврат "url";

КонецФункции

// Возвращает именованное значение Заголовок.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция Заголовок() Экспорт

	Возврат "header";

КонецФункции

// Возвращает именованное значение ЧастьЗапроса.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция ЧастьЗапроса() Экспорт

	Возврат "query_part";

КонецФункции

// Возвращает именованное значение Данные.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция Данные() Экспорт

	Возврат "data";

КонецФункции

// Возвращает именованное значение ДанныеБезСсылкиНаФайл.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция ДанныеБезСсылкиНаФайл() Экспорт

	Возврат "data_without_file_reference";

КонецФункции

// Возвращает именованное значение ДвоичныеДанные.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция ДвоичныеДанные() Экспорт

	Возврат "binary_data";

КонецФункции

// Возвращает именованное значение КодированныеДанные.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция КодированныеДанные() Экспорт

	Возврат "url_encoded_data";

КонецФункции

// Возвращает именованное значение JSON.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция JSON() Экспорт

	Возврат "json";

КонецФункции

// Возвращает именованное значение Форма.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция Форма() Экспорт

	Возврат "form";

КонецФункции

// Возвращает именованное значение СтроковаяФорма.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция СтроковаяФорма() Экспорт

	Возврат "form_string";

КонецФункции

// Возвращает именованное значение Результат.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция Результат() Экспорт

	Возврат "result";

КонецФункции

// Возвращает именованное значение УчетныеДанные.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция УчетныеДанные() Экспорт

	Возврат "credentials";

КонецФункции

// Возвращает именованное значение Прокси.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция Прокси() Экспорт

	Возврат "proxy";

КонецФункции

// Возвращает именованное значение Сертификат.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция Сертификат() Экспорт

	Возврат "certificate";

КонецФункции

// Возвращает именованное значение ПользовательскийАгент.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция ПользовательскийАгент() Экспорт

	Возврат "user_agent";

КонецФункции

// Возвращает именованное значение ЦелоеНеотрицательное.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция ЦелоеНеотрицательное() Экспорт

	Возврат "non_negative_integer";

КонецФункции

// Возвращает именованное значение ДесятичноеНеотрицательное.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция ДесятичноеНеотрицательное() Экспорт

	Возврат "non_negative_decimal";

КонецФункции

#КонецОбласти
