#Область ПрограммныйИнтерфейс

// Возвращает именованное значение Установить.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция Установить() Экспорт

	Возврат "set";

КонецФункции

// Возвращает именованное значение Добавить.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция Добавить() Экспорт

	Возврат "add";

КонецФункции

// Возвращает именованное значение ПередатьПустой.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция ПередатьПустой() Экспорт

	Возврат "set_empty";

КонецФункции

// Возвращает именованное значение Удалить.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция Удалить() Экспорт

	Возврат "remove";

КонецФункции

// Возвращает именованное значение ЗагрузитьИзФайла.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция ЗагрузитьИзФайла() Экспорт

	Возврат "load_file";

КонецФункции

// Возвращает именованное значение ЗагрузитьИзСтандартногоВвода.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция ЗагрузитьИзСтандартногоВвода() Экспорт

	Возврат "load_stdin";

КонецФункции

// Возвращает именованное значение УстановитьЕслиОтсутствует.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция УстановитьЕслиОтсутствует() Экспорт

	Возврат "set_if_absent";

КонецФункции

// Возвращает именованное значение ОпределитьПослеВычисления.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция ОпределитьПослеВычисления() Экспорт

	Возврат "deferred";

КонецФункции

#КонецОбласти
