#Область ПрограммныйИнтерфейс

// Возвращает именованное значение РесурсИРезультат.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция РесурсИРезультат() Экспорт

	Возврат "resource_and_result";

КонецФункции

// Возвращает именованное значение ЗапросИЗаголовки.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция ЗапросИЗаголовки() Экспорт

	Возврат "request_and_headers";

КонецФункции

// Возвращает именованное значение Тело.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция Тело() Экспорт

	Возврат "body";

КонецФункции

// Возвращает именованное значение Аутентификация.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция Аутентификация() Экспорт

	Возврат "authentication";

КонецФункции

// Возвращает именованное значение TLS.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция TLS() Экспорт

	Возврат "tls";

КонецФункции

// Возвращает именованное значение Прокси.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция Прокси() Экспорт

	Возврат "proxy";

КонецФункции

// Возвращает именованное значение СоединениеИПолитики.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция СоединениеИПолитики() Экспорт

	Возврат "connection_and_policies";

КонецФункции

#КонецОбласти
