#Область ПрограммныйИнтерфейс

// Возвращает именованное значение GET.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция GET() Экспорт

	Возврат "GET";

КонецФункции

// Возвращает именованное значение HEAD.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция HEAD() Экспорт

	Возврат "HEAD";

КонецФункции

// Возвращает именованное значение POST.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция POST() Экспорт

	Возврат "POST";

КонецФункции

// Возвращает именованное значение PUT.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция PUT() Экспорт

	Возврат "PUT";

КонецФункции

// Возвращает именованное значение ЗависитОтПротокола.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция ЗависитОтПротокола() Экспорт

	Возврат "depends_on_protocol";

КонецФункции

#КонецОбласти
