#Область ПрограммныйИнтерфейс

// Возвращает протокол HTTP.
//
// Возвращаемое значение:
//   Строка - Схема URL.
Функция HTTP() Экспорт

	Возврат "http";

КонецФункции

// Возвращает протокол HTTPS.
//
// Возвращаемое значение:
//   Строка - Схема URL.
Функция HTTPS() Экспорт

	Возврат "https";

КонецФункции

// Возвращает протокол FTP.
//
// Возвращаемое значение:
//   Строка - Схема URL.
Функция FTP() Экспорт

	Возврат "ftp";

КонецФункции

// Возвращает протокол FTPS.
//
// Возвращаемое значение:
//   Строка - Схема URL.
Функция FTPS() Экспорт

	Возврат "ftps";

КонецФункции

// Возвращает протокол FILE.
//
// Возвращаемое значение:
//   Строка - Схема URL.
Функция FILE() Экспорт

	Возврат "file";

КонецФункции

// Возвращает протокол DICT.
//
// Возвращаемое значение:
//   Строка - Схема URL.
Функция DICT() Экспорт

	Возврат "dict";

КонецФункции

// Возвращает протокол IMAP.
//
// Возвращаемое значение:
//   Строка - Схема URL.
Функция IMAP() Экспорт

	Возврат "imap";

КонецФункции

// Возвращает протокол LDAP.
//
// Возвращаемое значение:
//   Строка - Схема URL.
Функция LDAP() Экспорт

	Возврат "ldap";

КонецФункции

// Возвращает протокол POP3.
//
// Возвращаемое значение:
//   Строка - Схема URL.
Функция POP3() Экспорт

	Возврат "pop3";

КонецФункции

// Возвращает протокол SMTP.
//
// Возвращаемое значение:
//   Строка - Схема URL.
Функция SMTP() Экспорт

	Возврат "smtp";

КонецФункции

// Возвращает протокол SOCKS4.
//
// Возвращаемое значение:
//   Строка - Схема URL.
Функция SOCKS4() Экспорт

	Возврат "socks4";

КонецФункции

// Возвращает протокол SOCKS4A.
//
// Возвращаемое значение:
//   Строка - Схема URL.
Функция SOCKS4A() Экспорт

	Возврат "socks4a";

КонецФункции

// Возвращает протокол SOCKS5.
//
// Возвращаемое значение:
//   Строка - Схема URL.
Функция SOCKS5() Экспорт

	Возврат "socks5";

КонецФункции

// Возвращает протокол SOCKS5H.
//
// Возвращаемое значение:
//   Строка - Схема URL.
Функция SOCKS5H() Экспорт

	Возврат "socks5h";

КонецФункции

#КонецОбласти
