#Область ПрограммныйИнтерфейс

// Возвращает именованное значение Нет.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция Нет() Экспорт

	Возврат "none";

КонецФункции

// Возвращает именованное значение ВопросительныйЗнак.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция ВопросительныйЗнак() Экспорт

	Возврат "question_mark";

КонецФункции

// Возвращает именованное значение Амперсанд.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция Амперсанд() Экспорт

	Возврат "ampersand";

КонецФункции

// Возвращает именованное значение ОпределитьПоАдресу.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция ОпределитьПоАдресу() Экспорт

	Возврат "depends_on_url";

КонецФункции

#КонецОбласти
