#Область ПрограммныйИнтерфейс

// Возвращает именованное значение ЛитеральноеЗначение.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция ЛитеральноеЗначение() Экспорт

	Возврат "literal";

КонецФункции

// Возвращает именованное значение ТекстовыйФайлБезCRLFNUL.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция ТекстовыйФайлБезCRLFNUL() Экспорт

	Возврат "text_file_without_crlf_nul";

КонецФункции

// Возвращает именованное значение ДвоичныйФайл.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция ДвоичныйФайл() Экспорт

	Возврат "binary_file";

КонецФункции

// Возвращает именованное значение СтандартныйВвод.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция СтандартныйВвод() Экспорт

	Возврат "stdin";

КонецФункции

// Возвращает именованное значение НеблокирующийСтандартныйВвод.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция НеблокирующийСтандартныйВвод() Экспорт

	Возврат "nonblocking_stdin";

КонецФункции

// Возвращает именованное значение ОпределитьПослеВычисления.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция ОпределитьПослеВычисления() Экспорт

	Возврат "deferred";

КонецФункции

#КонецОбласти
