#Область ПрограммныйИнтерфейс

// Возвращает именованное значение Отключен.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция Отключен() Экспорт

	Возврат "disabled";

КонецФункции

// Возвращает именованное значение Настроен.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция Настроен() Экспорт

	Возврат "configured";

КонецФункции

// Возвращает именованное значение ОпределитьПослеВычисления.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция ОпределитьПослеВычисления() Экспорт

	Возврат "deferred";

КонецФункции

#КонецОбласти
