#Область ПрограммныйИнтерфейс

// Возвращает именованное значение СтандартныйВывод.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция СтандартныйВывод() Экспорт

	Возврат "stdout";

КонецФункции

// Возвращает именованное значение Файл.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция Файл() Экспорт

	Возврат "file";

КонецФункции

// Возвращает именованное значение ИмяИзURL.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция ИмяИзURL() Экспорт

	Возврат "remote_name";

КонецФункции

// Возвращает именованное значение ОпределитьПослеВычисления.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция ОпределитьПослеВычисления() Экспорт

	Возврат "deferred";

КонецФункции

#КонецОбласти
