#Область ПрограммныйИнтерфейс

// Возвращает именованное значение Basic.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция Basic() Экспорт

	Возврат "basic";

КонецФункции

// Возвращает именованное значение Digest.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция Digest() Экспорт

	Возврат "digest";

КонецФункции

// Возвращает именованное значение NTLM.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция NTLM() Экспорт

	Возврат "ntlm";

КонецФункции

// Возвращает именованное значение Negotiate.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция Negotiate() Экспорт

	Возврат "negotiate";

КонецФункции

// Возвращает именованное значение OAuth2Bearer.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция OAuth2Bearer() Экспорт

	Возврат "oauth2_bearer";

КонецФункции

#КонецОбласти
