#Область ПрограммныйИнтерфейс

// Возвращает именованное значение ЦелоеНеотрицательное.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция ЦелоеНеотрицательное() Экспорт

	Возврат "non_negative_integer";

КонецФункции

// Возвращает именованное значение ДесятичноеНеотрицательное.
//
// Возвращаемое значение:
//   Строка - Именованное значение предметной модели curl.
Функция ДесятичноеНеотрицательное() Экспорт

	Возврат "non_negative_decimal";

КонецФункции

#КонецОбласти
