#Использовать errors
#Использовать "../../shared"

Перем _ИдентификаторГенератора; // Строка - Идентификатор генератора.
Перем _НаименованиеГенератора; // Строка - Наименование генератора.
Перем _ВерсияКонтрактаГенератора; // Число - Версия SPI.
Перем _ВозможностиГенератора; // ФиксированныйМассив из Строка - Возможности генератора.

#Область ОбработчикиСобытий

// Создаёт неизменяемое описание генератора.
//
// Параметры:
//   Идентификатор - Строка - Идентификатор генератора.
//   Наименование - Строка - Наименование генератора.
//   ВерсияКонтракта - Число - Версия SPI.
//   Возможности - ФиксированныйМассив из Строка - Возможности генератора.
Процедура ПриСозданииОбъекта(Идентификатор, Наименование, ВерсияКонтракта, Возможности)

	_ИдентификаторГенератора = Идентификатор;
	_НаименованиеГенератора = Наименование;
	_ВерсияКонтрактаГенератора = ВерсияКонтракта;
	_ВозможностиГенератора = Новый ФиксированныйМассив(КоллекцииМоделиCURL.Скопировать(Возможности));

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает идентификатор генератора.
//
// Возвращаемое значение:
//   Строка - Идентификатор генератора.
Функция Идентификатор() Экспорт
	Возврат _ИдентификаторГенератора;
КонецФункции

// Возвращает наименование генератора.
//
// Возвращаемое значение:
//   Строка - Наименование генератора.
Функция Наименование() Экспорт
	Возврат _НаименованиеГенератора;
КонецФункции

// Возвращает версию контракта генератора.
//
// Возвращаемое значение:
//   Число - Версия SPI.
Функция ВерсияКонтракта() Экспорт
	Возврат _ВерсияКонтрактаГенератора;
КонецФункции

// Возвращает неизменяемый список возможностей генератора.
//
// Возвращаемое значение:
//   ФиксированныйМассив из Строка - Возможности генератора.
Функция Возможности() Экспорт
	Возврат _ВозможностиГенератора;
КонецФункции

#КонецОбласти
