// BSLLS:ExportVariables-off

#Использовать errors

// Исходная команда curl.
Перем Команда Экспорт; // Строка, Массив из Произвольный, ФиксированныйМассив из Произвольный

// Идентификатор целевого генератора.
// Идентификаторы встроенных целей см. в модуле ЦелиКонвертацииCURL.
Перем Цель Экспорт; // Строка

// Код локали генерируемого программного кода.
// Поддерживаемые локали см. в модуле ЛокалиКонвертацииCURL.
Перем Локаль Экспорт; // Строка

// Дополнительные параметры целевого генератора.
Перем ПараметрыГенератора Экспорт; // Соответствие из КлючИЗначение:
                                   //   * Ключ - Произвольный - Ключ параметра генератора.
                                   //   * Значение - Произвольный - Значение параметра генератора.

#Область ОбработчикиСобытий

// Создаёт параметры конвертации команды curl.
//
// Параметры:
//   Команда - Строка,
//             Массив из Произвольный,
//             ФиксированныйМассив из Произвольный - Непустая исходная команда curl.
Процедура ПриСозданииОбъекта(Команда)

	ЭтотОбъект.Команда = СкопироватьКоманду(Команда);
	Цель = ЦелиКонвертацииCURL.ПлатформенныйHTTP();
	Локаль = ЛокалиКонвертацииCURL.Русская();
	ПараметрыГенератора = Новый Соответствие;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СкопироватьКоманду(Команда)

	ТипКоманды = ТипЗнч(Команда);
	Если ТипКоманды = Тип("Массив") Или ТипКоманды = Тип("ФиксированныйМассив") Тогда
		Возврат = КоллекцииМоделиCURL.Скопировать(Аргумент);
	КонецЕсли;

	Возврат Команда;

КонецФункции

#КонецОбласти
