// BSLLS:ExportVariables-off

#Использовать errors

// Исходная команда curl.
Перем Команда Экспорт; // Строка, Массив из Произвольный, ФиксированныйМассив из Произвольный

// Идентификатор целевого генератора.
// Идентификаторы встроенных целей см. в модуле ЦелиКонвертацииCURL.
Перем Цель Экспорт; // Строка

// Код локали генерируемого программного кода.
// Поддерживаемые локали см. в модуле ЛокалиКонвертацииCURL.
Перем Локаль Экспорт; // Строка

// Дополнительные параметры целевого генератора.
Перем ПараметрыГенератора Экспорт; // Соответствие из КлючИЗначение:
                                   //   * Ключ - Произвольный - Ключ параметра генератора.
                                   //   * Значение - Произвольный - Значение параметра генератора.

#Область ОбработчикиСобытий

// Создаёт параметры конвертации команды curl.
//
// Параметры:
//   Команда - Строка,
//             Массив из Произвольный,
//             ФиксированныйМассив из Произвольный - Непустая исходная команда curl.
//
// Исключения:
//   Если команда имеет неверный тип или не заполнена.
Процедура ПриСозданииОбъекта(Команда)

	Если ТипЗнч(Команда) = Тип("Неопределено") Тогда
		ВызватьИсключение СтандартныеОшибки.НеверныйТипАргумента(
			"Команда",
			"Строка,Массив,ФиксированныйМассив",
			Команда
		);
	КонецЕсли;

	ПроверкаАргументов.ПроверитьТип(
		"Команда",
		Команда,
		"Строка,Массив,ФиксированныйМассив"
	);

	ПроверкаАргументов.ПроверитьЗаполненность("Команда", Команда);

	ЭтотОбъект.Команда = СкопироватьКоманду(Команда);

	Цель = ЦелиКонвертацииCURL.ПлатформенныйHTTP();
	Локаль = ЛокалиКонвертацииCURL.Русская();
	ПараметрыГенератора = Новый Соответствие;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СкопироватьКоманду(Команда)

	ТипКоманды = ТипЗнч(Команда);
	Если ТипКоманды = Тип("Массив") Или ТипКоманды = Тип("ФиксированныйМассив") Тогда
		КопияКоманды = Новый Массив;
		Для Каждого Аргумент Из Команда Цикл
			КопияКоманды.Добавить(Аргумент);
		КонецЦикла;
		Возврат КопияКоманды;
	КонецЕсли;

	Возврат Команда;

КонецФункции

#КонецОбласти
