#Область ПрограммныйИнтерфейс

// Возвращает вид элемента опции curl.
//
// Возвращаемое значение:
//   Строка - Вид элемента разобранной команды.
Функция Опция() Экспорт

	Возврат "option";

КонецФункции

// Возвращает вид элемента URL.
//
// Возвращаемое значение:
//   Строка - Вид элемента разобранной команды.
Функция URL() Экспорт

	Возврат "url";

КонецФункции

// Возвращает вид границы группы операций curl.
//
// Возвращаемое значение:
//   Строка - Вид элемента разобранной команды.
Функция ГраницаГруппы() Экспорт

	Возврат "group_boundary";

КонецФункции

#КонецОбласти
