#Область ПрограммныйИнтерфейс

// Возвращает вид элемента опции curl.
//
// Возвращаемое значение:
//   Строка - Вид элемента разобранной команды.
Функция Опция() Экспорт

	Возврат "option";

КонецФункции

// Возвращает вид элемента URL.
//
// Возвращаемое значение:
//   Строка - Вид элемента разобранной команды.
Функция URL() Экспорт

	Возврат "url";

КонецФункции

// Возвращает вид границы секции команды curl.
//
// Возвращаемое значение:
//   Строка - Вид элемента разобранной команды.
Функция ГраницаСекцииКоманды() Экспорт

	Возврат "command_section_boundary";

КонецФункции

#КонецОбласти
