#Область ПрограммныйИнтерфейс

// Возвращает правило повторения без дополнительного эффекта.
//
// Возвращаемое значение:
//   Строка - Правило повторения опции.
Функция БезДополнительногоЭффекта() Экспорт

	Возврат "no_effect";

КонецФункции

// Возвращает правило выбора последнего значения.
//
// Возвращаемое значение:
//   Строка - Правило повторения опции.
Функция ПоследнееЗначение() Экспорт

	Возврат "last";

КонецФункции

// Возвращает правило выбора первого значения.
//
// Возвращаемое значение:
//   Строка - Правило повторения опции.
Функция ПервоеЗначение() Экспорт

	Возврат "first";

КонецФункции

// Возвращает правило добавления каждого значения.
//
// Возвращаемое значение:
//   Строка - Правило повторения опции.
Функция Добавление() Экспорт

	Возврат "append";

КонецФункции

#КонецОбласти
