#Область ПрограммныйИнтерфейс

// Возвращает режим опции, которая не принимает значение.
//
// Возвращаемое значение:
//   Строка - Режим значения опции.
Функция НеПринимает() Экспорт

	Возврат "none";

КонецФункции

// Возвращает режим опции, которая требует значение.
//
// Возвращаемое значение:
//   Строка - Режим значения опции.
Функция Требует() Экспорт

	Возврат "required";

КонецФункции

// Возвращает режим опции, которая принимает необязательное значение.
//
// Возвращаемое значение:
//   Строка - Режим значения опции.
Функция Необязательное() Экспорт

	Возврат "optional";

КонецФункции

#КонецОбласти
