#Область ПрограммныйИнтерфейс

// Возвращает булев тип значения опции.
//
// Возвращаемое значение:
//   Строка - Тип значения опции.
Функция Булевое() Экспорт

	Возврат "boolean";

КонецФункции

// Возвращает строковый тип значения опции.
//
// Возвращаемое значение:
//   Строка - Тип значения опции.
Функция Строковое() Экспорт

	Возврат "string";

КонецФункции

// Возвращает числовой тип значения опции.
//
// Возвращаемое значение:
//   Строка - Тип значения опции.
Функция Числовое() Экспорт

	Возврат "number";

КонецФункции

#КонецОбласти
