// BSLLS:LatinAndCyrillicSymbolInWord-off

#Использовать asserts
#Использовать "../../src/public"

#Область Тесты

&Тест
Процедура ТестДолжен_ПредоставитьИдентификаторПлатформенногоHTTP() Экспорт

	// Действие и Проверка
	Ожидаем.Что(ЦелиКонвертацииCURL.ПлатформенныйHTTP()).Равно("1c");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПредоставитьИдентификаторКоннектораHTTP() Экспорт

	// Действие и Проверка
	Ожидаем.Что(ЦелиКонвертацииCURL.КоннекторHTTP()).Равно("connector");

КонецПроцедуры

#КонецОбласти
