#Область ПрограммныйИнтерфейс

// Возвращает идентификатор тестовой цели.
//
// Возвращаемое значение:
//   Строка - Идентификатор цели.
Функция идентификатор() Экспорт

	Возврат "case-insensitive-functions";

КонецФункции

// Возвращает наименование тестовой цели.
//
// Возвращаемое значение:
//   Строка - Наименование цели.
Функция НАИМЕНОВАНИЕ() Экспорт

	Возврат "Генератор с другим регистром функций";

КонецФункции

// Возвращает поддерживаемую версию SPI.
//
// Возвращаемое значение:
//   Число - Версия SPI.
Функция версияконтракта() Экспорт

	Возврат 1;

КонецФункции

// Возвращает возможности тестовой цели.
//
// Возвращаемое значение:
//   ФиксированныйМассив из Строка - Пустой набор возможностей.
Функция ВОЗМОЖНОСТИ() Экспорт

	Возврат Новый ФиксированныйМассив(Новый Массив);

КонецФункции

// Возвращает код тестовой цели.
//
// Параметры:
//   Контекст - КонтекстГенерацииКода - Контекст генерации.
//
// Возвращаемое значение:
//   Строка - Код тестовой цели.
Функция сгенерировать(Контекст) Экспорт

	Возврат "// Тестовый код";

КонецФункции

#КонецОбласти
