Перем ИдентификаторГенератора;
Перем ВозможностиГенератора;
Перем Счетчики;

#Область ПрограммныйИнтерфейс

Процедура ПриСозданииОбъекта(Идентификатор = "test-generator", Возможности = Неопределено)
	ИдентификаторГенератора = Идентификатор;

	Если Возможности = Неопределено Тогда
		Возможности = Новый ФиксированныйМассив(Новый Массив);
	КонецЕсли;

	ВозможностиГенератора = Возможности;
	Счетчики = Новый Соответствие;
КонецПроцедуры

Функция Идентификатор() Экспорт
	УчестьЧтение("Идентификатор");
	Возврат ИдентификаторГенератора;
КонецФункции

Функция Наименование() Экспорт
	УчестьЧтение("Наименование");
	Возврат "Генератор для проверки конвертации";
КонецФункции

Функция ВерсияКонтракта() Экспорт
	УчестьЧтение("ВерсияКонтракта");
	Возврат 1;
КонецФункции

Функция Возможности() Экспорт
	УчестьЧтение("Возможности");
	Возврат ВозможностиГенератора;
КонецФункции

Функция Сгенерировать(КонтекстГенерацииКода) Экспорт
	УчестьЧтение("Сгенерировать");
	Возврат СтрШаблон(
		"// url=%1; locale=%2; parameters=%3",
		КонтекстГенерацииКода.Операции()[0].Ресурс().АдресДляВыполнения().ЛитеральноеЗначение(),
		КонтекстГенерацииКода.Локаль(),
		КонтекстГенерацииКода.ПараметрыГенератора().Количество()
	);
КонецФункции

Функция КоличествоВызовов(ИмяМетода) Экспорт
	Значение = Счетчики.Получить(ИмяМетода);
	Возврат ?(Значение = Неопределено, 0, Значение);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УчестьЧтение(ИмяМетода)
	Счетчики.Вставить(ИмяМетода, КоличествоВызовов(ИмяМетода) + 1);
КонецПроцедуры

#КонецОбласти
