#Использовать jason
#Использовать "../../core"

Перем ПулКонвертеровКомандыCURL; // ПулКонвертеровКомандыCURL

&Контроллер("/")
Процедура ПриСозданииОбъекта(
	&Деталька(
		Значение = "curlone.web.МаксимальноеКоличествоОдновременныхКонвертаций",
		ЗначениеПоУмолчанию = 50
	) МаксимальноеКоличествоОдновременныхКонвертаций
)
	ПулКонвертеровКомандыCURL = Новый ПулКонвертеровКомандыCURL(МаксимальноеКоличествоОдновременныхКонвертаций);
КонецПроцедуры

&ТочкаМаршрута("")
&Отображение("./src/interface/view/index.html")
Процедура Главная(Ответ) Экспорт
КонецПроцедуры

&ТочкаМаршрута("/api")
Процедура API(Ответ) Экспорт
	Ответ.Перенаправить("/api/v1");
КонецПроцедуры

&ТочкаМаршрута("/api/v1")
&Отображение("./src/interface/view/api.html")
Процедура APIv1() Экспорт
КонецПроцедуры

&ТочкаМаршрута("/api/v1/convert")
Процедура Конвертировать(ПараметрыЗапросаИменные, Ответ) Экспорт
	Перем Ошибки;

	ДанныеОтвета = Новый Структура("result, errors", "", Новый Массив());
	
	ТекстКоманды = ПараметрыЗапросаИменные.Получить("cmd");
	Язык = ПараметрыЗапросаИменные.Получить("lang");
	Локаль = ПараметрыЗапросаИменные.Получить("locale");
	ДесериализоватьОтветИзJSON = НРег(ПараметрыЗапросаИменные.Получить("response-type")) = "json";
	СериализаторJson = Новый СериализаторJson();

	Если Локаль = Неопределено Тогда
		Локаль = ЛокальПоУмолчанию();
	КонецЕсли;

	Если ТекстКоманды <> Неопределено Тогда
		
		Генератор = ПолучитьГенератор(Язык);	
		Генератор.ДесериализоватьОтветИзJSON(ДесериализоватьОтветИзJSON);

		КонвертерКомандыCURL = Неопределено;
		Попытка

			КонвертерКомандыCURL = ПулКонвертеровКомандыCURL.Получить();
			КонвертерКомандыCURL.УстановитьЯзыкПеревода(Локаль);
			ДанныеОтвета.result = КонвертерКомандыCURL.Конвертировать(ТекстКоманды, Генератор, Ошибки);

			Для Каждого Ошибка Из Ошибки Цикл
				ДанныеОтвета.errors.Добавить(НоваяОшибка(Ошибка.Текст, Ошибка.Критичная));
			КонецЦикла;

		Исключение

			ИнформацияОбИсключении = ИнформацияОбОшибке();
			Если КонвертерКомандыCURL <> Неопределено Тогда
				ПулКонвертеровКомандыCURL.Отбросить();
				КонвертерКомандыCURL = Неопределено;
			КонецЕсли;

			ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбИсключении);
			ДанныеОтвета.errors.Добавить(НоваяОшибка(ТекстОшибки, Истина));

		КонецПопытки;

		Если КонвертерКомандыCURL <> Неопределено Тогда
			ПулКонвертеровКомандыCURL.Вернуть(КонвертерКомандыCURL);
		КонецЕсли;

	КонецЕсли;

	Ответ.УстановитьТипКонтента("json");
	Ответ.ТелоТекст = СериализаторJson.Сериализовать(ДанныеОтвета);

КонецПроцедуры

Функция ПолучитьГенератор(Язык)

	Если Язык = "connector" Тогда
		Возврат Новый ГенераторПрограммногоКодаКоннекторHTTP();
	ИначеЕсли Язык = "1c" Тогда
		Возврат Новый ГенераторПрограммногоКода1С();
	Иначе
		Возврат ГенераторПоУмолчанию();
	КонецЕсли;

КонецФункции

Функция ГенераторПоУмолчанию()
	Возврат Новый ГенераторПрограммногоКода1С();
КонецФункции

Функция ЛокальПоУмолчанию()
	Возврат "ru";
КонецФункции

Функция НоваяОшибка(Текст, Критичная = Ложь)
	Возврат Новый Структура("text, critical", Текст, Критичная);
КонецФункции
