#Использовать packageinfo

Перем ВерсияПриложения; // Строка

#Область ОбработчикиСобытий

&Контроллер("/")
Процедура ПриСозданииОбъекта()

	ИнформацияОПакете = Новый ИнформацияОПакете("packagedef");
	ВерсияПриложения = ИнформацияОПакете.Версия();

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

&ТочкаМаршрута("")
&Отображение("./src/interface/view/index.html")
// Отображает главную страницу приложения.
//
// Параметры:
//   Ответ - HTTPОтвет - HTTP-ответ для формирования модели шаблона.
Процедура Главная(Ответ) Экспорт

	Ответ.Модель = Новый Структура(
		"ВерсияПриложения, СсылкаНаВерсию",
		ВерсияПриложения,
		"https://github.com/alei1180/curlone/releases/tag/ver" + ВерсияПриложения
	);

КонецПроцедуры

#КонецОбласти
