
#Использовать errors
#Использовать jason
#Использовать ".."
#Использовать "internal"
#Использовать autumn
#Использовать autumn-cli
#Использовать winow
#Использовать "cli"

Процедура Запустить()

	ИнициализацияТекущегоКаталога();

	КонсольноеПриложение = Новый КонсольноеПриложениеCurlone;
	Если КонсольноеПриложение.Поддерживает(АргументыКоманднойСтроки) Тогда
		Результат = КонсольноеПриложение.ВыполнитьКоманду(АргументыКоманднойСтроки);

		ВыводРезультата = Новый ВыводРезультатаCurlone;
		ВыводРезультата.Записать(Результат);

		ЗавершитьРаботу(Результат.КодЗавершения());
	КонецЕсли;

	Поделка = Новый Поделка;
	Поделка.ЗапуститьПриложение();

КонецПроцедуры

Процедура ИнициализацияТекущегоКаталога()
	ТекущийКаталог = Новый Файл(ОбъединитьПути(ТекущийСценарий().Каталог, "..")).ПолноеИмя;
	УстановитьТекущийКаталог(ТекущийКаталог);
КонецПроцедуры

Запустить();
