
#Использовать errors
#Использовать jason
#Использовать ".."
#Использовать autumn
#Использовать winow
#Использовать "cli"

#Область СлужебныеПроцедурыИФункции

Процедура Запустить()

	КонсольноеПриложение = Новый КонсольноеПриложениеCurlone;
	Аргументы = КонсольноеПриложение.ПодготовитьАргументы(АргументыКоманднойСтроки);
	ПараметрыСервера = КонсольноеПриложение.ПараметрыЗапускаСервера(Аргументы);

	Если ПараметрыСервера <> Неопределено Тогда
		ЗапуститьВебСервер(ПараметрыСервера);
	Иначе
		ВыполнитьКонсольнуюКоманду(КонсольноеПриложение, Аргументы);
	КонецЕсли;

КонецПроцедуры

Процедура ЗапуститьВебСервер(ПараметрыСервера)

	Поделка = Новый Поделка(СоветДляПоделки());
	УстановитьТекущийКаталог(КаталогПроекта());
	Поделка.ЗапуститьПриложение();

	НастройкиВебСервера = Поделка.НайтиЖелудь("Настройки");
	ПортПоУмолчанию = Поделка.НайтиДетальку("curlone.web.Порт", НастройкиВебСервера.Порт);
	НастройкиВебСервера.Порт = ПортЗапускаСервера(ПараметрыСервера, ПортПоУмолчанию);

	Если ПараметрыСервера.ОткрытьВБраузере Тогда
		ОткрытиеИнтерфейса = Новый ОткрытиеВебИнтерфейсаCurlone(НастройкиВебСервера.Порт);
		ФоновыеЗадания.Выполнить(ОткрытиеИнтерфейса, "ОткрытьСЗадержкой");
	КонецЕсли;

	Поделка.НайтиЖелудь("ВебСервер").Старт();

КонецПроцедуры

Процедура ВыполнитьКонсольнуюКоманду(КонсольноеПриложение, Аргументы)

	Результат = КонсольноеПриложение.ВыполнитьКоманду(Аргументы);
	Результат = ЗаписатьРезультат(Результат);

	ЗавершитьРаботу(Результат.КодЗавершения());

КонецПроцедуры

Функция ЗаписатьРезультат(Результат)

	ВыводРезультата = Новый ВыводРезультатаCurlone;
	Попытка
		ВыводРезультата.Записать(Результат);
	Исключение
		Результат = Новый РезультатВыполненияCurlone(
			КодыЗавершенияCurlone.ВнутренняяОшибка(),
			"",
			"Внутренняя ошибка записи результата curlone"
		);
		ВыводРезультата.Записать(Результат);
	КонецПопытки;

	Возврат Результат;

КонецФункции

Функция СоветДляПоделки()

	КаталогПроекта = КаталогПроекта();

	НастройкиВебИнтерфейса = Новый Соответствие;
	НастройкиВебИнтерфейса.Вставить("Порт", 3333);
	НастройкиВебИнтерфейса.Вставить("МаксимальноеКоличествоОдновременныхКонвертаций", 50);

	НастройкиCurlone = Новый Соответствие;
	НастройкиCurlone.Вставить("web", НастройкиВебИнтерфейса);

	КаталогиСФайлами = Новый Соответствие;
	КаталогиСФайлами.Вставить("/images", "src/web/view/images");
	КаталогиСФайлами.Вставить("/static", "src/web/view/static");

	НастройкиВебСервера = Новый Соответствие;
	НастройкиВебСервера.Вставить("ИмяХоста", "127.0.0.1"); // BSLLS:UsingHardcodeNetworkAddress-off
	НастройкиВебСервера.Вставить("Порт", 3333);
	НастройкиВебСервера.Вставить("КаталогСПриложениями", ОбъединитьПути(КаталогПроекта, "src/web"));
	НастройкиВебСервера.Вставить("КаталогиСФайлами", КаталогиСФайлами);

	ЗначенияДеталек = Новый Соответствие;
	ЗначенияДеталек.Вставить("winow", НастройкиВебСервера);
	ЗначенияДеталек.Вставить("curlone", НастройкиCurlone);

	Совет = Новый СоветДругогоМастера;
	Совет.ЗначенияДеталек(ЗначенияДеталек);

	Возврат Совет;

КонецФункции

Функция КаталогПроекта()

	Возврат Новый Файл(ОбъединитьПути(ТекущийСценарий().Каталог, "..")).ПолноеИмя;

КонецФункции

Функция ПортЗапускаСервера(ПараметрыСервера, ПортПоУмолчанию)
	Возврат ?(ПараметрыСервера.Порт = Неопределено, ПортПоУмолчанию, ПараметрыСервера.Порт);
КонецФункции

#КонецОбласти

Запустить();
