
#Использовать errors
#Использовать jason
#Использовать ".."
#Использовать autumn
#Использовать winow
#Использовать "cli"

#Область СлужебныеПроцедурыИФункции

Процедура Запустить()

	ИнициализацияТекущегоКаталога();

	КонсольноеПриложение = Новый КонсольноеПриложениеCurlone;
	Аргументы = КонсольноеПриложение.ПодготовитьАргументы(АргументыКоманднойСтроки);
	ПараметрыСервера = КонсольноеПриложение.ПараметрыЗапускаСервера(Аргументы);

	Если ПараметрыСервера <> Неопределено Тогда
		ЗапуститьВебСервер(ПараметрыСервера);
	Иначе
		ВыполнитьКонсольнуюКоманду(КонсольноеПриложение, Аргументы);
	КонецЕсли;

КонецПроцедуры

Процедура ЗапуститьВебСервер(ПараметрыСервера)

	Поделка = Новый Поделка;
	Поделка.ЗапуститьПриложение();

	НастройкиВебСервера = Поделка.НайтиЖелудь("Настройки");
	НастройкиВебСервера.Порт = ПортЗапускаСервера(ПараметрыСервера, НастройкиВебСервера.Порт);

	Если ПараметрыСервера.ОткрытьВБраузере Тогда
		ОткрытиеИнтерфейса = Новый ОткрытиеВебИнтерфейсаCurlone(НастройкиВебСервера.Порт);
		ФоновыеЗадания.Выполнить(ОткрытиеИнтерфейса, "ОткрытьСЗадержкой");
	КонецЕсли;

	Поделка.НайтиЖелудь("ВебСервер").Старт();

КонецПроцедуры

Процедура ВыполнитьКонсольнуюКоманду(КонсольноеПриложение, Аргументы)

	Результат = КонсольноеПриложение.ВыполнитьКоманду(Аргументы);
	Результат = ЗаписатьРезультат(Результат);

	ЗавершитьРаботу(Результат.КодЗавершения());

КонецПроцедуры

Функция ЗаписатьРезультат(Результат)

	ВыводРезультата = Новый ВыводРезультатаCurlone;
	Попытка
		ВыводРезультата.Записать(Результат);
	Исключение
		Результат = Новый РезультатВыполненияCurlone(
			КодыЗавершенияCurlone.ВнутренняяОшибка(),
			"",
			"Внутренняя ошибка записи результата curlone"
		);
		ВыводРезультата.Записать(Результат);
	КонецПопытки;

	Возврат Результат;

КонецФункции

Функция ПортЗапускаСервера(ПараметрыСервера, ПортПоУмолчанию)
	Возврат ?(ПараметрыСервера.Порт = Неопределено, ПортПоУмолчанию, ПараметрыСервера.Порт);
КонецФункции

Процедура ИнициализацияТекущегоКаталога()

	ТекущийКаталог = Новый Файл(ОбъединитьПути(ТекущийСценарий().Каталог, "..")).ПолноеИмя;
	УстановитьТекущийКаталог(ТекущийКаталог);

КонецПроцедуры

#КонецОбласти

Запустить();
