#Использовать asserts
#Использовать "../../src/syntax"

#Область Тесты

&Тест
Процедура ТестДолжен_ПредоставитьВидыФрагментовТокена() Экспорт

	// Действие
	Значения = Новый Массив;
	Значения.Добавить(ВидыФрагментовТокенаCURL.Текст());
	Значения.Добавить(ВидыФрагментовТокенаCURL.Переменная());

	// Проверка
	ПроверитьЗначения(Значения, "text,variable");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПредоставитьРежимыЗначенияОпций() Экспорт

	// Действие
	Значения = Новый Массив;
	Значения.Добавить(РежимыЗначенияОпцийCURL.НеПринимает());
	Значения.Добавить(РежимыЗначенияОпцийCURL.Требует());
	Значения.Добавить(РежимыЗначенияОпцийCURL.Необязательное());

	// Проверка
	ПроверитьЗначения(Значения, "none,required,optional");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПредоставитьТипыЗначенийОпций() Экспорт

	// Действие
	Значения = Новый Массив;
	Значения.Добавить(ТипыЗначенийОпцийCURL.Булевое());
	Значения.Добавить(ТипыЗначенийОпцийCURL.Строковое());
	Значения.Добавить(ТипыЗначенийОпцийCURL.Числовое());

	// Проверка
	ПроверитьЗначения(Значения, "boolean,string,number");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПредоставитьОбластиДействияОпций() Экспорт

	// Действие
	Значения = Новый Массив;
	Значения.Добавить(ОбластиДействияОпцийCURL.Глобальная());
	Значения.Добавить(ОбластиДействияОпцийCURL.Локальная());

	// Проверка
	ПроверитьЗначения(Значения, "global,local");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПредоставитьПравилаПовторенияОпций() Экспорт

	// Действие
	Значения = Новый Массив;
	Значения.Добавить(ПравилаПовторенияОпцийCURL.БезДополнительногоЭффекта());
	Значения.Добавить(ПравилаПовторенияОпцийCURL.ПоследнееЗначение());
	Значения.Добавить(ПравилаПовторенияОпцийCURL.ПервоеЗначение());
	Значения.Добавить(ПравилаПовторенияОпцийCURL.Добавление());

	// Проверка
	ПроверитьЗначения(Значения, "no_effect,last,first,append");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПредоставитьВидыЭлементовРазобраннойКоманды() Экспорт

	// Действие
	Значения = Новый Массив;
	Значения.Добавить(ВидыЭлементовРазобраннойКомандыCURL.Опция());
	Значения.Добавить(ВидыЭлементовРазобраннойКомандыCURL.URL());
	Значения.Добавить(ВидыЭлементовРазобраннойКомандыCURL.ГраницаСекцииКоманды());

	// Проверка
	ПроверитьЗначения(Значения, "option,url,command_section_boundary");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьЗначения(Значения, ОжидаемыеЗначения)

	Ожидаемые = СтрРазделить(ОжидаемыеЗначения, ",");
	Уникальные = Новый Соответствие;
	Для Каждого Значение Из Значения Цикл
		Уникальные.Вставить(Значение, Истина);
	КонецЦикла;

	Ожидаем.Что(Значения).ИмеетДлину(Ожидаемые.Количество());
	Ожидаем.Что(Уникальные).ИмеетДлину(Ожидаемые.Количество());
	Для Индекс = 0 По Ожидаемые.ВГраница() Цикл
		Ожидаем.Что(Значения[Индекс]).Равно(Ожидаемые[Индекс]);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
