Перем _Токены; // ФиксированныйМассив из ТокенКомандыCURL
Перем _Ошибки; // ФиксированныйМассив из ИнформацияОбОшибке

#Область ОбработчикиСобытий

// Создаёт результат лексического разбора.
//
// Параметры:
//   Токены - Массив, ФиксированныйМассив из ТокенКомандыCURL - Полученные токены.
//   Ошибки - Массив, ФиксированныйМассив из ИнформацияОбОшибке - Ошибки разбора.
Процедура ПриСозданииОбъекта(Токены, Ошибки)

	_Токены = СкопироватьМассив(Токены);
	_Ошибки = СкопироватьМассив(Ошибки);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СкопироватьМассив(Источник)

	Копия = Новый Массив;
	Для Каждого Элемент Из Источник Цикл
		Копия.Добавить(Элемент);
	КонецЦикла;

	Возврат Новый ФиксированныйМассив(Копия);

КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает признак успешного разбора.
//
// Возвращаемое значение:
//   Булево - Истина, если ошибки отсутствуют.
Функция Успешно() Экспорт

	Возврат _Ошибки.Количество() = 0;

КонецФункции

// Возвращает токены.
//
// Возвращаемое значение:
//   ФиксированныйМассив из ТокенКомандыCURL - Полученные токены.
Функция Токены() Экспорт

	Возврат _Токены;

КонецФункции

// Возвращает ошибки разбора.
//
// Возвращаемое значение:
//   ФиксированныйМассив из ИнформацияОбОшибке - Ошибки разбора.
Функция Ошибки() Экспорт

	Возврат _Ошибки;

КонецФункции

#КонецОбласти
