#использовать "../src/core"
#Использовать asserts

&Тест
Процедура ПроверитьТМассивДат() Экспорт

	// Дано
	Команда = ЗагрузитьСценарий("tests/fixtures/КомандаСМассивами.os");

	Приложение = Новый КонсольноеПриложение("cp", "");
	Приложение.Версия("v version", "1.0");
	ПараметрыКоманды = Новый Массив();
	ПараметрыКоманды.Добавить("testingarray");
	ПараметрыКоманды.Добавить("-a");
	ПараметрыКоманды.Добавить("2023-04-13;2023-04-14");

	Приложение.ДобавитьКоманду("testingarray", "Тестируем массив", Команда);

	// Когда
	
	Приложение.Запустить(ПараметрыКоманды);

	// Тогда
	
	Ожидаем.Что(Команда.МассивДат[0], "дата1").Равно(Дата("20230413000000"));
	Ожидаем.Что(Команда.МассивДат[1], "дата2").Равно(Дата("20230414000000"));

КонецПроцедуры