// BSLLS:LatinAndCyrillicSymbolInWord-off

#Использовать asserts
#Использовать errors
#Использовать "../.."
#Использовать "../../src/internal"
#Использовать "../../src/public"

#Область Тесты

&Тест
Процедура ТестДолжен_СформироватьДоговорныеДанныеРезультата() Экспорт

	// Подготовка
	Предупреждения = Новый Массив;
	Предупреждения.Добавить(Новый ПредупреждениеКонвертацииCURL(
		"warning.code",
		"Предупреждение",
		"retry",
		"--retry",
		2,
		"connector"
	));
	Результат = Новый РезультатКонвертацииCURL(
		"Результат = Истина;",
		Неопределено,
		Предупреждения,
		"connector"
	);

	// Действие
	Данные = Новый ФормированиеДанныхРезультатаКонвертацииCURL().Сформировать(Результат, "1c");

	// Проверка
	Ожидаем.Что(Данные.success).Равно(Истина);
	Ожидаем.Что(Данные.target).Равно("connector");
	Ожидаем.Что(Данные.code).Равно("Результат = Истина;");
	Ожидаем.Что(Данные.errors.Количество()).Равно(0);
	Ожидаем.Что(Данные.warnings.Количество()).Равно(1);

	Предупреждение = Данные.warnings[0];
	Ожидаем.Что(Предупреждение.code).Равно("warning.code");
	Ожидаем.Что(Предупреждение.message).Равно("Предупреждение");
	Ожидаем.Что(Предупреждение.capability).Равно("retry");
	Ожидаем.Что(Предупреждение.option).Равно("--retry");
	Ожидаем.Что(Предупреждение.position).Равно(2);
	Ожидаем.Что(Предупреждение.target).Равно("connector");

КонецПроцедуры

&Тест
Процедура ТестДолжен_СформироватьПозициюОшибки() Экспорт

	// Подготовка
	Ошибки = Новый Массив;
	Ошибки.Добавить(ФабрикаОшибок.Создать(
		КодыОшибокCurlone.ТребуетсяCurl(),
		"В начале команды ожидается curl",
		Новый ФиксированнаяСтруктура(Новый Структура("ПозицияВИсходнойСтроке", 1))
	));
	Результат = Новый РезультатКонвертацииCURL("", Ошибки);

	// Действие
	Данные = Новый ФормированиеДанныхРезультатаКонвертацииCURL().Сформировать(
		Результат,
		"1c"
	);

	// Проверка
	Ожидаем.Что(Данные.errors[0].position).Равно(1);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗаменитьНулевуюПозициюНаNull() Экспорт

	// Подготовка
	Предупреждения = Новый Массив;
	Предупреждения.Добавить(Новый ПредупреждениеКонвертацииCURL(
		"warning.code",
		"Предупреждение",
		"",
		"",
		0,
		"1c"
	));
	Результат = Новый РезультатКонвертацииCURL("Код", Неопределено, Предупреждения, "1c");

	// Действие
	Данные = Новый ФормированиеДанныхРезультатаКонвертацииCURL().Сформировать(Результат, "1c");

	// Проверка
	Ожидаем.Что(Данные.warnings[0].position).Равно(Null);

КонецПроцедуры

#КонецОбласти
